/*
 Navicat Premium Data Transfer

 Source Server         : supertruck
 Source Server Type    : MySQL
 Source Server Version : 80021
 Source Host           : 139.224.22.9:3306
 Source Schema         : book_sales_is

 Target Server Type    : MySQL
 Target Server Version : 80021
 File Encoding         : 65001

 Date: 24/01/2021 21:59:47
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for bms_book
-- ----------------------------
DROP TABLE IF EXISTS `bms_book`;
CREATE TABLE `bms_book`  (
  `id` bigint unsigned NOT NULL COMMENT '自增id',
  `name` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '图书名称',
  `create_time` datetime(0) NOT NULL COMMENT '记录创建时间',
  `modify_time` datetime(0) NOT NULL COMMENT '记录修改时间',
  `category_id` bigint unsigned NOT NULL COMMENT '图书分类号',
  `description` varchar(1000) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '图书描述',
  `picture` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '图书图片url',
  `price` decimal(10, 2) UNSIGNED NOT NULL COMMENT '价格',
  `sale` int unsigned NOT NULL COMMENT '图书销量',
  `stock` int unsigned NOT NULL COMMENT '图书库存',
  `isbn` char(13) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '书号',
  `author` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '作者名，如果有多个作者，以逗号分隔',
  `press` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '出版社名',
  `language` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NULL DEFAULT NULL COMMENT '图书语言',
  `page_count` int(0) NULL DEFAULT NULL COMMENT '图书页数',
  `publish_date` datetime(0) NULL DEFAULT NULL COMMENT '出版日期',
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `idx_name`(`name`) USING BTREE COMMENT '图书名索引',
  INDEX `idx_isbn`(`isbn`) USING BTREE COMMENT '图书号索引',
  INDEX `idx_category_id`(`category_id`) USING BTREE COMMENT '分类号索引',
  INDEX `idx_press`(`press`) USING BTREE COMMENT '出版社索引',
  INDEX `price`(`price`) USING BTREE,
  CONSTRAINT `FK_category_id` FOREIGN KEY (`category_id`) REFERENCES `bms_category` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB AUTO_INCREMENT = 281 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of bms_book
-- ----------------------------
INSERT INTO `bms_book` VALUES (1, '中华人民共和国民法典', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 9, '《中华人民共和国民法典》被称为“社会生活百科全书”，是民事权利的宣言书和保障书。本书收录的是《中华人民共和国民法典》标准文本，共7编，依次为总则编、物权编、合同编、人格权编、婚姻家庭编、继承编、侵权责任编以及附则，并按照权威版本进行了全文折校，保证文字的精准性', 'http://image31.bookschina.com/2020/zuo/6/s8318234.jpg', 56.00, 0, 99, '9787010221571', '中国法制出版社', '中国法制出版社', '', 266, '2020-06-01 00:00:00');
INSERT INTO `bms_book` VALUES (2, '刑法学讲义', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 9, '“法律男神”罗翔教授为每一位普通读者写的刑法普及讲义。', 'http://image12.bookschina.com/2020/20200828/1/s8366493.jpg', 64.50, 0, 99, '9787222193727', '罗翔，果麦文化 出品', '云南人民出版社', '', 359, '2020-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (3, '法的门前', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 9, '既汲取了原书的精华，又特别为中国读者考虑，删繁就简，精心筛选和编撰了适合中国读者的素材和内容，尤其适合法学院的学生以及希望了解和思考美国司法模式的读者作为基础读物。', 'https://pic.baike.soso.com/ugc/baikepic2/8805/20201110141025-1823603726_jpeg_300_300_14999.jpg/0', 46.50, 0, 99, '9787301206430', '中国法制出版社', '中国法制出版社', '', 436, '2012-06-24 00:00:00');
INSERT INTO `bms_book` VALUES (5, '洞穴奇案', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 9, '《洞穴奇案》讲述的是五名洞穴探险人受困山洞，无法在短期内获救。为了维生以待救援，大家约定抽签吃掉其中一人，牺牲他以救活其余四人。', 'http://image12.bookschina.com/2019/20190918/1/s8167461.jpg', 53.10, 0, 99, '9787108039873', '【美】彼得 ・ 萨伯（Peter Suber），译者：陈福勇 张世泰    后浪', '九州出版社', '', 157, '2012-04-01 00:00:00');
INSERT INTO `bms_book` VALUES (7, '圆圈正义', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 9, '《圆圈正义》一书共收录作者的49篇随笔文章,分为“圆圈正义”“何谓榜样”“道德谴责的打开方式”“身负权力 各自珍重”“法律人的理智和多数人的情感”“生命的尊严”“心怀永恒 活在当下”七大部分，作者在本书中运用特有的坦诚、自省而尖锐的笔调，探讨了法律、正义、道德的理念与现实、分析了如社会热点案件、分享了自身求学经验和对人生的思考。', 'http://image12.bookschina.com/2019/20190918/1/s8167461.jpg', 31.70, 0, 99, '9787521603774', '罗翔', '中国法制出版社', '', 307, '2019-08-26 00:00:00');
INSERT INTO `bms_book` VALUES (8, '中华人民共和国刑法・实用版', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 9, '刑法是规定犯罪与刑罚的法律，是我国的基本法律。', 'https://cdn.5ibc.net/book/thumb/47/27/201512160013594983840.jpg', 24.00, 0, 99, '9787509366523', '中国法制出版社', '中国法制出版社', '', 259, '2015-09-01 00:00:00');
INSERT INTO `bms_book` VALUES (9, '民法典条文对照与重点解读', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 9, '', 'http://image12.bookschina.com/2020/20200702/2/s8333178.jpg', 60.40, 0, 99, '9787519743772', '杜月秋，孙政 编', '法律出版社', '', 159, '2020-05-01 00:00:00');
INSERT INTO `bms_book` VALUES (10, '中华人民共和国宪法・实用版', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 9, '', 'https://pic.baike.soso.com/p/20100725/bki-20100725125827-1769892711.jpg', 15.30, 0, 99, '9787802267343', '中国法制出版社', '中国法制出版社', '', 205, '2018-11-01 00:00:00');
INSERT INTO `bms_book` VALUES (11, '中华人民共和国民法典释义', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 9, '', 'http://image12.bookschina.com/2020/20200830/1/s8365146.jpg', 381.10, 0, 99, '9787516222195', '黄薇 主编', '法律出版社', '', 235, '2020-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (12, '异乡人', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 9, '我知道这世界我无处容身，只是，你凭什么审判我的灵魂？', 'http://image12.bookschina.com/2019/20190814/1/s8148859.jpg', 26.60, 0, 99, '9787301251782', '（法）加缪　著，张一乔　译', '北京大学出版社', '', 144, '2015-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (13, '法学方法论', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 9, '主要介绍了十九世纪初至一次世界大战结束期间，德国的法学理论及方法论。', 'http://image12.bookschina.com/2013/20131217/s6395255.jpg', 88.30, 0, 99, '9787100037297', '卡尔・拉伦茨', '商务印书馆', '', 386, '2003-10-01 00:00:00');
INSERT INTO `bms_book` VALUES (14, '逝者之书', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 9, '不留心死亡，便看不见生活', 'https://img01.sogoucdn.com/v2/thumb/crop/xy/ai/x/0/y/0/w/120/h/120/iw/90/ih/90/t/0/ir/3?t=2&appid=200997&url=https%3A%2F%2Fimg2.doubanio.com%2Fview%2Fsubject%2Fl%2Fpublic%2Fs33639763.jpg&sign=c9815802231e64ab503299ddfb46705e', 42.70, 0, 99, '9787569036107', '法医秦明', '四川大学出版社', '', 240, '2020-05-20 00:00:00');
INSERT INTO `bms_book` VALUES (15, '民法思维: 请求权基础理论体系', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 9, ' 兼容英美法系判例研究与大陆法系学理探讨，构建全新法学思维模式', 'http://image31.bookschina.com/2010/20100208/s4454180.jpg', 36.10, 0, 99, '9787301159125', '王泽鉴　著', '北京大学出版社', '', 332, '2009-12-01 00:00:00');
INSERT INTO `bms_book` VALUES (16, '你不可不知的法律常识', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 9, '酒后出事，同席者承担多大责任？样品误当新品卖，是否构成消费欺诈？车借给朋友出了事故，责任由谁承担？是不是所有的合同都可以采用电子签名？', 'http://image12.bookschina.com/2017/20170905/s7469279.jpg', 39.60, 0, 99, '9787515819556', '张志强 著', '中华工商联合出版社', '', 280, '2017-05-01 00:00:00');
INSERT INTO `bms_book` VALUES (18, '中华人民共和国民法典理解与适用', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 9, '', 'http://image12.bookschina.com/2020/20200826/2/s8378047.jpg', 1278.40, 0, 99, '9.78751E+12', '最高人民法院民法典贯彻实施工作领导小组', '人民法院出版社', '', 1024, '2020-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (19, '是非与曲直：个案中的法理', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 9, '《是非与曲直：个案中的法理》以“药家鑫案”“许霆案”“黄碟案”等曾引发社会广泛争议的案例为研究“标本”，以法学家的理性、敏锐和洞察力，从那些被人们、甚至法律人有意遗忘、主动省略或懒得验证的但却至关重要的情节和事实入手，提出了与众不同的思考和结论，极具启发意义。', 'http://www.law-lib.com/shopping/images/82253.jpg', 68.00, 0, 99, '9787301305805', '苏力', '北京大学出版社', '', 376, '2019-08-01 00:00:00');
INSERT INTO `bms_book` VALUES (20, '法理学:法律哲学与法律方法', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 9, '本书把散见于1940年《法理学》一书中的有关法理学思想发展的历史资料集中在第一部分。本书第二部发和第三部分中对一般法律理论的实质性问题所作的论述，乃是以某些蕴含在我研究法理学问题的进路中的哲学假设和方法论假设为基础的。', 'http://image12.bookschina.com/2017/20170822/s7555713.jpg', 38.00, 0, 99, '9787562017677', '(美) E?博登海默', '中国政法大学出版社', '', 612, '1998-12-01 00:00:00');
INSERT INTO `bms_book` VALUES (21, '全彩图解电工电路', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 6, '本书主要内容包括电工识图基础知识、三相异步电动机启动电路、三相异步电动机运行电路、三相异步电动机制动电路、三相异步电动机控制电路设计与维修等', 'http://image12.bookschina.com/2018/20181222/s7975615.jpg', 46.10, 0, 99, '9787122326195', '乔长君，李东升  等编', '化学工业出版社', '', 301, '2019-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (22, '图解汽车原理与构造', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 6, '本书采用图解的方式，系统地介绍汽车的结构与原理，并突出了新知识、新技术。', 'http://image12.bookschina.com/2016/20160525/s7188303.jpg', 66.20, 0, 99, '9787122263711', '张金柱 主编', '化学工业出版社', '', 239, '2016-05-01 00:00:00');
INSERT INTO `bms_book` VALUES (23, '面向成本的产品设计：降本设计之道', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 6, '本书详细介绍了面向成本的产品设计，包括产品成本认知、DFC流程、目标成本管理、材料选择、制造及装配工艺选择、装配件成本计算、降低装配件成本的设计、塑胶件成本计算、降低塑胶件成本的设计、冲压件成本计算、降低冲压件成本的设计和DFC成本计算软件等，指导企业和工程师一步一步、脚踏实地把降本设计从口号变为具体行动。', 'http://image12.bookschina.com/2020/20200910/2/s8256840.jpg', 51.40, 0, 99, '9787111642206', '钟元', '机械工业出版社', '', 386, '2020-03-20 00:00:00');
INSERT INTO `bms_book` VALUES (25, '电工基础', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 6, '全书共五个单元，具体内容有：直流电路，电磁和电磁感应，单相正弦交流电路，三相正弦交流电路和电路的过渡过程。', 'http://image31.bookschina.com/2010/20100813/s4797954.jpg', 46.10, 0, 99, '9787508398716', '邱勇进', '化学工业出版社', '', 203, '2010-02-01 00:00:00');
INSERT INTO `bms_book` VALUES (26, '从零开始学电子元器件--识别・检测・维修・代换・应用', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 6, '', 'http://www.kfzimg.com/sw/kfzimg/245/2e3fc8565157b280_n.jpg', 47.80, 0, 99, '9787122298928', '张校铭  主编', '化学工业出版社', '', 361, '2017-09-01 00:00:00');
INSERT INTO `bms_book` VALUES (27, '电工电路识图、布线、接线与维修', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 6, '本书针对电工技术人员和初学者识读电路以及上岗工作的需要，介绍电路基本知识的基础上，精选常用到的经典电路，从电路组成、原理、布线和接线、故障检修多方面详细说明了：电子元器件及电子电路识图、常用低压电气部件的识图与低压变配电线路、照明线路、电动机控制线路、变压器、继电保护及配电线路、变频器及PLC控制电路与梯形图、机床与冰箱小家电等电器线路的识图与安装接线技巧、故障维修要领等内容。', 'http://image12.bookschina.com/2015/20150212/s6798633.jpg', 65.30, 0, 99, '9787122305206', '张振文  主编', '化学工业出版社', '', 512, '2018-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (28, '我是怎样设计飞机的', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 6, '美国飞机设计师凯利・约翰逊自传', 'http://image12.bookschina.com/2019/20190603/3/s8061372.jpg', 38.20, 0, 99, '9787553679747', '[美]克拉伦斯・伦纳德・凯利・约翰逊、 [美]玛吉・史密斯Maggie Smith，译者：杨松  后浪', '浙江教育出版社', '', 248, '2019-05-01 00:00:00');
INSERT INTO `bms_book` VALUES (29, '新能源汽车结构与原理', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 6, '本书结合汽车企业如宝马、奔驰、大众、奥迪及我国比亚迪、北汽新能源、上汽荣威等品牌在新能源汽车上的技术成果，以全彩图解的形式，生动形象地诠释了新能源汽车各种形式，以及运行原理，且以“电池、电机、电控”为独立章节重点介绍了电动汽车核心技术部件的结构及原理。', 'http://image12.bookschina.com/2019/20190807/2/s8143415.jpg', 84.50, 0, 99, '9787122324511', '瑞佩尔  主编', '化学工业出版社', '', 247, '2019-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (30, '5G移动通信系统设计与标准详解', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 6, '本书是一本专门介绍5G系统设计与标准的图书，书中内容涵盖了5G系统从标准体系到接口、从物理层到高层、从基带到射频的各个方面，对需求、技术及标准分别进行了详细介绍', 'http://image12.bookschina.com/2020/20200906/4/s8294399.jpg', 191.00, 0, 99, '9787115530387', '王映民 孙韶辉 等', '人民邮电出版社', '', 653, '2020-04-01 00:00:00');
INSERT INTO `bms_book` VALUES (31, '杜邦安全管理', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 6, '本书作者从事企业安全生产工作30余年，将杜邦安全管理进行了系统梳理，并融入我国科学发展、安全发展的指导思想，结合我国实际，深入浅出介绍了杜邦安全简介、十大安全理念、可持续运营管理、过程安全管理、设备完整性管理、安全管理领导力、安全文化管理等杜邦安全管理精髓，其目的是让更多的企业学习杜邦管理、实践杜邦理念、享受杜邦成果。', 'http://image12.bookschina.com/2019/20190220/1/s7986648.jpg', 39.50, 0, 99, '9787122322463', '崔政斌，张美元，周礼庆  编著', '化学工业出版社', '', 236, '2019-01-04 00:00:00');
INSERT INTO `bms_book` VALUES (32, '从零开始学机械', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 6, '本书通俗易懂地介绍了机械工程的基本概念和知识，主要包括机械的运动机构、制造方法、常用的材料、使用环境、传感器与执行元件、控制方法等。本书叙述语言简练、图文并茂，增加了图书的趣味性和可读性。', 'http://image12.bookschina.com/2018/20180406/s7382007.jpg', 20.50, 0, 99, '9787122278722', '（日）门田和雄　著', '化学工业出版社', '', 203, '2017-01-02 00:00:00');
INSERT INTO `bms_book` VALUES (33, 'PLC与触摸屏、变频器、组态软件应用一本通', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 6, '本书介绍西门子S7-200 SMART PLC和昆仑通泰触摸屏、西门子MM420变频器、西门子WinCC组态软件的综合应用。内容包括西门子PLC的编程方法、控制系统开发流程、开关量控制程序的设计、模拟量控制程序的设计，触摸屏实用案例、触摸屏与PLC综合应用案例，变频器实用案例、变频器与PLC综合应用案例，监控组态软件实用案例、监控组态软件与PLC的综合应用案例。', 'http://image12.bookschina.com/2019/20190605/2/s7932022.jpg', 74.90, 0, 99, '9787122327802', '韩相争  编著', '化学工业出版社', '', 306, '2018-11-01 00:00:00');
INSERT INTO `bms_book` VALUES (34, '智能化战争', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 6, '人工智能AI虽然是战争体系的一个局部，但由于其“类脑”功能的能力越来越强，必将主宰未来战争全局。本书作者吴明曦，具有三十多年相关领域和专业技术背景，全书以宏大的视野、敏锐的眼光、深远的预见，第一次从九大形态质变、九种典型特征、九大领域应用、九维建设评估、战场生态重构、作战体系进化等视角，全面阐述了智能化战争的场景和画卷，带给你未来基于AI对抗的无限遐想……', 'http://image12.bookschina.com/2020/20200909/1/s8274227.jpg', 122.80, 0, 99, '9787118120325', '吴明曦', '国防工业出版社', '', 700, '2020-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (35, '电气工程师自学成才手册', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 6, '电气工程师自学成才手册》分为基础篇、提高篇、精通篇三册。本书为精通篇，主要包括PLC入门与实践操作，三菱FX系列PLC硬件接线和软元件说明，三菱PLC编程与仿真软件的使用，基本梯形图元件与指令的使用及实例，步进指令的使用及实例，应用指令的使用举例，模拟量模块的使用，PLC通信，变频器的使用，变频器的典型控制功能及应用电路，变频器的选用、安装与维护，PLC与变频器的综合应用，触摸屏与PLC的综合应用，交流伺服系统的组成与原理，三菱通用伺服驱动器的硬件系统，三菱伺服驱动器的显示操作与参数设置，伺服驱动器三种工作模式的应用举例与标准接线，步进电机与步进驱动器的使用及应用实例，三菱定位模块的使用等内容。', 'http://image12.bookschina.com/2018/20180520/s7742376.jpg', 81.60, 0, 99, '9787121331701', '蔡杏山', '电子工业出版社', '', 496, '2018-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (36, '从零开始学电子制作', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 6, '本书从原始的矿石收音机制作讲起，通过130个制作实例，详细介绍了门控门铃类小电器的制作、充电器类小电器制作、灯光控制类小电器制作、医用类小电器的制作、报警防盗类小电器的制作、温湿度控制类电器制作、音响类、生活类电子产品制作等各类型制作的电路板和图纸设计、元器件焊接组装、调试与检修等方法和技巧。书中通过大量实例、制作步骤图解与视频讲解相结合的方式，清晰、直观讲解电子制作的流程、所需的电路相关原理知识以及最终制作成电子产品的方法和技巧，读者看得懂，学得会，还可以举一反三，将所讲到的案例通过拆解与组合的方法用到别的电子产品中。', 'http://image12.bookschina.com/2019/20190807/2/s8143399.jpg', 57.40, 0, 99, '9787122338075', '张校铭  主编', '化学工业出版社', '', 242, '2019-08-01 00:00:00');
INSERT INTO `bms_book` VALUES (37, '从零开始学电子电路设计', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 6, '《从零开始学电子电路设计 》本模拟电路、数字电路、传感器应用、单片机的基础知识和设计技能为一体，通过设计实例循序渐进讲解习电子电路设计所需要掌握的方法和技能', 'http://image12.bookschina.com/2019/20190603/6/s8055860.jpg', 76.60, 0, 99, '9787122337139', '刘炳海  主编  赵显通，董忠　副主编', '化学工业出版社', '', 333, '2019-05-01 00:00:00');
INSERT INTO `bms_book` VALUES (38, '木工全书', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 6, '英国木工字典级教科书', 'http://image12.bookschina.com/2018/20180307/s7827442.jpg', 122.90, 0, 99, '9787530469750', '（英）英国DK出版社 编著，张亦斌 李文一 译', '北京科学技术出版社', '', 399, '2014-05-01 00:00:00');
INSERT INTO `bms_book` VALUES (40, '电气二次接线识图', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 6, '《电气二次接线识图》全书共分十二章，主要内容有电气控制接线概述、互感器及其接线、断路器及其控制、隔离开关及其控制、信号系统、测量及监察系统、输电线路保护、变压器保护、母线差动保护及断路器失灵保护、自动装置、操作电源及接线、控制接线的安装施工图等。', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/i1/2620984798/O1CN01pAS71Y1lJWxLu5522_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 17.80, 0, 99, '9787508302010', '文锋 臧家义 主编', '中国电力出版社', '', 220, '2000-02-01 00:00:00');
INSERT INTO `bms_book` VALUES (42, '环球国家地理百科全书', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 5, '色彩艳丽、内容丰富、特色鲜明的大众地理读物。', 'http://image31.bookschina.com/2018/fm/10/s7196884.jpg', 199.00, 0, 99, '9787550275102', '王越', '北京联合出版公司', '', 175, '2016-06-01 00:00:00');
INSERT INTO `bms_book` VALUES (43, '地球:行星的力量', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 5, '探秘地球，130名摄影师和技术人员辗转62个国家，深入到偏远荒无人烟的地带，历经五年，拍摄到了许多以前从未被人类所知的动物为生存而斗争的场景。', 'http://image12.bookschina.com/2020/20201122/1/s8391415.jpg', 88.00, 0, 99, '9787564076306', '(英)伊恩・斯图尔特  (英)约翰・林奇', ' 北京理工大学出版社', '', 226, '2013-09-01 00:00:00');
INSERT INTO `bms_book` VALUES (44, '海错图笔记', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 5, '清代画家兼生物爱好者聂璜绘制的《海错图》，共描绘了300多种生物，几乎涵盖无脊椎动物门和脊索动物门的大部分主要类群，还记载了不少海滨植物，是一本颇具现代博物学风格的奇书。', 'http://image31.bookschina.com/2017/zuo/10/s7589022.jpg', 60.50, 0, 99, '9787508669069', '张辰亮（@博物君）著，中国国家地理・图书 出品', '中信出版社', '', 240, '2016-11-01 00:00:00');
INSERT INTO `bms_book` VALUES (45, '有趣得让人睡不着的地理', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 5, '日本著名科普作家左卷健男带你领略 动人的、有活力的地理魅力', 'http://image12.bookschina.com/2019/20190717/4/s8122726.jpg', 31.20, 0, 99, '9787569929898', '(日) 左卷健男 编著 ; 郝彤彤译', '北京时代华文书局', '', 208, '2019-06-01 00:00:00');
INSERT INTO `bms_book` VALUES (46, '夜观星空：天文观测实践指南', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 5, '针对天文爱好者，从宇宙结构讲起，详细介绍了夜空中著名的恒星、行星、星团、星系以及彗星、流星和极光等，并介绍了各种观测方法，既包括目视观测，也包括使用双筒望远镜和天文望远镜观测。', 'http://image12.bookschina.com/2012/20120831/s5590820.jpg', 74.90, 0, 99, '9787530458990', '(加)特伦斯.迪金森', '北京科学技术出版社', '', 188, '2012-09-01 00:00:00');
INSERT INTO `bms_book` VALUES (47, '中国国家地理百科全书 ', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 5, '全书以中国行政区划为经，以每一省区市的行政区划、民族人口、历史文化、地貌、水系、自然资源、经济和旅游地理为纬，内容涵盖了中国地理知识的诸多方面。', 'http://image31.bookschina.com/2019/fm/12/s7214738.jpg', 118.10, 0, 99, '9787550275478', '张妙弟 主编', '北京联合出版公司', '', 1750, '2016-06-01 00:00:00');
INSERT INTO `bms_book` VALUES (48, '海错图笔记3', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 5, '一部海洋生物图谱', 'http://image31.bookschina.com/2019/zuo/9/s8173680.jpg', 69.40, 0, 99, '9787521708677', '张辰亮（@博物君）著， 中国国家地理・图书 出品', '中信出版社', '', 256, '2019-10-01 00:00:00');
INSERT INTO `bms_book` VALUES (49, '国家地理终极观星指南', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 5, '这是一本十分适合初级观星者的入门指南。', 'http://image31.bookschina.com/2017/zuo/9/s7571652.jpg', 60.50, 0, 99, '9787550286368', '（美）霍华德・施耐德，未读 出品', '北京联合出版公司', '', 288, '2017-08-01 00:00:00');
INSERT INTO `bms_book` VALUES (50, 'BBC星球系列：七个世界，一个星球', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 5, '《七个世界》一书描述并展示了许多珍稀动物，以及地球上仍然存在的一些最引人注目的自然奇观。', 'http://image12.bookschina.com/2020/20201108/2/s8409225.jpg', 161.30, 0, 99, '9787547434550', '强尼・基林 、斯科特・亚历山大，译者 王浩。 果麦文化 出品', '山东画报出版社', '', 328, '2020-09-01 00:00:00');
INSERT INTO `bms_book` VALUES (51, '矿物与岩石图鉴 :教你辨认231种矿物与65种岩石', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 5, '《矿物与岩石图鉴》选取了具有代表性的231种矿物和65种岩石，对其进行了详细介绍，包括类别、成分、硬度、特征、成因、鉴定、比重、解理、断口、晶系等，并且还为每种矿物与岩石配了多角度的高清彩色图片，展示矿物与岩石的各部位特征，以方便读者辨认。', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/i1/1049653664/O1CN01SFKIBc1cw9q9ZGiyM_!!1049653664-0-picasso.jpg_580x580Q90.jpg', 31.40, 0, 99, '9787553765747', '陈长伟   壹号图编辑部   凤凰含章出品', '江苏科学技术出版社', '', 254, '2017-04-01 00:00:00');
INSERT INTO `bms_book` VALUES (52, '海洋百科:蓝色星球', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 5, '地球四分之三的面积被水覆盖着，海洋影响我们的天气，塑造气候，为人类提供食物。尽管我们完全离不开海洋，但由于技术的限制，人类对海洋的了解还不到5%，比对火星的了解都少。', 'http://image31.bookschina.com/2018/fm/03/s7720933.jpg', 149.50, 0, 99, '9787553788227', '[英]詹姆斯?霍尼伯内（James Honeyborne） ，马克?布朗罗', '江苏科学技术出版社', '', 304, '2018-04-01 00:00:00');
INSERT INTO `bms_book` VALUES (53, '海错图笔记2', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 5, '本书是继《海错图笔记》之后，《博物》杂志编辑张辰亮对《海错图》继续深入解读的又一次心得分享。第二册收集了作者最新的24篇考察、论证笔记。', 'https://g-search2.alicdn.com/img/bao/uploaded/i4/i4/2209243098913/O1CN012TsT262FiClVP3HAf_!!0-item_pic.jpg_580x580Q90.jpg', 69.40, 0, 99, '9787508680651', '张辰亮（@博物君） 著，中国国家地理・图书 出品', '中信出版社', '', 256, '2017-10-01 00:00:00');
INSERT INTO `bms_book` VALUES (54, '天文学入门：带你一步一步成功探索星空', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 5, '两位天文学家结合多年天文探索和知识普及的经验，用深入浅出的讲解方式，专门为广大天文爱好者著成了这本天文学领域的入门读物。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i1/379752521/O1CN011UUex8dbKhbkdmQ_!!0-item_pic.jpg_580x580Q90.jpg', 75.90, 0, 99, '9787530496640', '〔德〕魏纳・E.策尔尼克〔德〕赫尔曼-米歇尔・哈恩', '北京科学技术出版社', '', 192, '2018-10-01 00:00:00');
INSERT INTO `bms_book` VALUES (55, '漫步中国星空', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 5, '本书以我国古代流传至今的认星歌谣《步天歌》为基础，结合中西对照星图，帮助读者仰望星空，认识中国传统星象，并通过历史故事和人物典故，为大家呈现星空所蕴含的传统文化和寓意。', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/i1/381191231/O1CN01dywe771Kxq9l5wsXL_!!0-item_pic.jpg_580x580Q90.jpg', 53.80, 0, 99, '9787110083512', '齐锐//万昊宜', '科学普及出版社', '', 226, '2014-04-01 00:00:00');
INSERT INTO `bms_book` VALUES (56, '水知道答案', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 5, '《水知道答案》讲述了：听到“爱”与“感谢”，水结晶呈现完整美丽的六角形；被骂作”浑蛋”，水几乎不能形成结晶；听过古典音乐，水结晶风姿各异；听过重金属音乐，水结晶则歪曲散', 'http://image30.bookschina.com/5/5.01/s793314.jpg', 24.00, 0, 99, '9787544244343', '〔日〕江本胜 著，猿渡静子 译', '南海出版公司', '', 166, '2004-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (57, '水知道答案2：每一滴水都有一颗心', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 5, '水知道幸福生活的方法，知道我们该前进的方向。', 'http://image12.bookschina.com/2014/20140610/s6387803.jpg', 24.00, 0, 99, '9787544244381', '〔日〕江本胜 著，李炜 译', '南海出版公司', '', 181, '2009-06-01 00:00:00');
INSERT INTO `bms_book` VALUES (58, '星空图鉴', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 5, '我们看到的，可以比想象的更深邃。', 'http://image12.bookschina.com/2018/20180305/s7813533.jpg', 128.00, 0, 99, '9787513328708', '（法）埃马纽埃尔・博杜安 著，新经典 出品', '新星出版社', '', 244, '2018-06-01 00:00:00');
INSERT INTO `bms_book` VALUES (59, '发现之旅', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 5, '历史上最伟大的十次自然探险', 'http://image12.bookschina.com/2017/20170901/s7510414.jpg', 70.10, 0, 99, '9787100085007', '（英) 托尼 赖斯', '商务印书馆', '', 327, '2012-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (60, '星空帝国 中国古代星宿揭秘', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 5, '本书浓缩了诗词歌赋、书画碑拓、成语典故、民间传说等中国文化的元素，按照三垣四象二十八宿的顺序，以文图交融、古今贯通的编写方式，揭开了中国古代星宿系统的秘密，同时辅以中西对照的星座比较，既饱含文化色彩，又不失趣味性和生动性。', 'http://image12.bookschina.com/2016/20160821/s7262113.jpg', 61.60, 0, 99, '9787115421401', '徐刚  王燕平', '人民邮电出版社', '', 247, '2016-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (61, '住宅设计解剖书', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 11, '本书是一本图解式的住宅设计与规划解剖书，用易懂的 550 幅插图搭配解说文字，让您清楚了解关于家的所有设计与规划。书中处处可见作者幽默风趣的表达方式及巧妙比喻，比如“住宅设计，就像做一个美味的便当”“冰箱是万人迷，任何人都想靠近它”“摆错床的位置，半夜就得扑上床了”等，让你轻松吸取住宅设计的个中巧妙！', 'http://image12.bookschina.com/2018/20181001/3/s7891083.jpg', 57.40, 0, 99, '9787544266741', '（日）增田奏', '南海出版公司', '', 193, '2013-09-01 00:00:00');
INSERT INTO `bms_book` VALUES (62, '穿墙透壁剖视中国经典古建筑', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 11, '本书为作者二十年来中国古建筑考察的心得总结。', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/i2/720168176/O1CN01G3DGua2AGepWGOC9N_!!2-item_pic.png_580x580Q90.jpg', 70.80, 0, 99, '9787563390939', '李乾朗　著', '广西师范大学出版社', '', 414, '2009-10-01 00:00:00');
INSERT INTO `bms_book` VALUES (63, '走向新建筑', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 11, '向永远的建筑大师――勒・柯布西耶致敬，全世界建筑专业人士人手一册的经典之作！', 'http://image12.bookschina.com/2016/20160823/s7244172.jpg', 39.50, 0, 99, '9787561327197', '（法）勒・柯布西耶 著，杨至德 译，凤凰空间 出品', '江苏科学技术出版社', '', 272, '2004-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (64, '建筑思维的草图表达', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 11, '《建筑思维的草图表达》提供了学习空间绘画这一技艺的指导和建议，并可以使读者充满乐趣地进行实践。建筑思维草图表达的步骤方法从简单易懂的规则中发展出来，并通过能激发兴趣的实例图画进行说明。书中介绍了不同的绘画技巧和绘画表现手段，并将每种绘画的效果用丰富的实例展现了出来。', 'http://image12.bookschina.com/2018/20180403/s7437386.jpg', 36.70, 0, 99, '9787532239467', '迪特尔・普林茨  克劳斯・D・迈耶保克恩  著，赵巍岩  译，凤凰空间 出品', '江苏科学技术出版社', '', 120, '2005-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (65, '图解照明设计', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 11, '国际照明设计基础教程，专业室内灯光设计分享，结合实际案例，普通人也能看懂的室内设计专业读物', 'http://image12.bookschina.com/2018/20180102/s7751403.jpg', 46.10, 0, 99, '9787553780122', '［日］远藤和广 高桥翔 著，凤凰空间 出品', '江苏科学技术出版社', '', 128, '2018-08-04 00:00:00');
INSERT INTO `bms_book` VALUES (66, '营造法式', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 11, '营造法式》是北宋时期将作监李诫组织编撰的由官方颁行的一部建筑设计学著作，完成于北宋元符三年（1100年），首次刊行于北宋崇宁二年（1103年）。', 'http://image31.bookschina.com/small/52/35/1587352.jpg', 94.10, 0, 99, '9787010056241', '[宋]李诫', '重庆出版社', '', 422, '2006-09-01 00:00:00');
INSERT INTO `bms_book` VALUES (67, '住宅收纳设计全书', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 11, '', 'http://image12.bookschina.com/2018/20181006/1/s7900058.jpg', 48.50, 0, 99, '9787544293082', '（日）铃木信弘 著，新经典 出品', '南海出版公司', '', 260, '2009-03-06 00:00:00');
INSERT INTO `bms_book` VALUES (68, '包豪斯经典 1919―1933a', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 11, '本书向读者展示了位于柏林的包豪斯档案馆非常珍贵的收藏资料，包括文件、各种设计成品、研究手绘以及建筑模型等。通过对这些资料精美地编排，本书从包豪斯流派的起源到后期发展生动并成体系地介绍了包豪斯运动对艺术和建筑深刻的影响力，并对整个流派的重要人物如格罗皮乌斯、马塞尔•布劳耶、康定斯基和保罗•克利等都做了全面的诠释。', 'http://5b0988e595225.cdn.sohucs.com/images/20190326/ddf73e07ab414202b0bbcb7460674ec6.jpeg', 270.70, 0, 99, '9787553776354', '[德]包豪斯档案馆  [德]玛格达莱娜?德罗斯特  著，丁梦月  胡一可  译', '江苏科学技术出版社', '', 256, '2017-03-01 00:00:00');
INSERT INTO `bms_book` VALUES (70, '建筑工程施工手册', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 11, '建筑工程人员必备用书', 'http://image12.bookschina.com/2012/20120215/s5392368.jpg', 65.30, 0, 99, '9787122121431', '杨波', '化学工业出版社', '', 737, '2012-02-04 00:00:00');
INSERT INTO `bms_book` VALUES (71, '装修设计解剖书 ', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 11, '本书的许多个案都是业界的经典设计，但许多参考这些案例的作品，往往会因为外观、视觉的因素而做一些改变，因而失去了原设计的精髓。本书介绍这些设计的原始初衷，我们在设计时，找回原始设计的精神与巧思！ 带你了解现代建筑四大巨匠引领杰出女设计师，创造出法兰克福厨房，马赛公寓的厨房吧台，施罗德住宅的客厅，黄金比例厨房等经典设计的背后故事。', 'http://image12.bookschina.com/2018/20181001/3/s7891072.jpg', 57.40, 0, 99, '9787544266727', '（日）松下希和', '南海出版公司', '', 135, '2013-09-01 00:00:00');
INSERT INTO `bms_book` VALUES (72, '室内设计师必知的100个节点', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 11, ' 室内细部设计基础教程 施工图解读分析 建筑装饰装修墙面地面幕墙施工节点 装饰装修家居室内设计', 'http://image12.bookschina.com/2017/20170905/s7473716.jpg', 92.10, 0, 99, '9787553780139', '韩力炜 郭瑞勇 主编，凤凰空间 出品', '江苏科学技术出版社', '', 260, '2017-04-01 00:00:00');
INSERT INTO `bms_book` VALUES (73, '贝聿铭建筑十讲', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 11, '巴黎只有一个卢浮宫, 世间只有一个贝聿铭', 'http://image12.bookschina.com/2019/20190717/1/s8131030.jpg', 75.00, 0, 99, '9787571303037', '黄健敏；凤凰空间 出品', '江苏凤凰科学技术出版社', '', 264, '2019-06-01 00:00:00');
INSERT INTO `bms_book` VALUES (74, '外部空间设计', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 11, '日本著名建筑大师芦原义信经典之作！', 'http://image12.bookschina.com/2017/20170902/s7502735.jpg', 39.50, 0, 99, '9787112003549', '芦原义信 著，凤凰空间 出品', '江苏凤凰文艺出版社', '', 119, '1985-03-01 00:00:00');
INSERT INTO `bms_book` VALUES (75, '照明设计终极圣经', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 11, '室内灯光设计宝典，超实用图文对照，贴近生活，专业易懂', 'http://image12.bookschina.com/2015/20150323/s6893223.jpg', 54.50, 0, 99, '9787553744476', '漂亮家居编辑部 编，凤凰空间 出品', '江苏科学技术出版社', '', 256, '2015-05-01 00:00:00');
INSERT INTO `bms_book` VALUES (76, '室内设计基础', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 11, '解决室内设计与施工问题的专业参考书/室内设计师资格考试必备的参考资料', 'http://image31.bookschina.com/small/56/85/2623856.jpg', 58.60, 0, 99, '9787532246595', '(日)和田浩一 等', '中国青年出版社', '', 137, '2006-02-01 00:00:00');
INSERT INTO `bms_book` VALUES (77, '设计准则：成为自已的室内设计师', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 11, '教你如何让自己的家变得更具风格、温', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/i3/1987018158/O1CN01QRUnzm2A8PlAnYuHm_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 23.70, 0, 99, '9787547403693', '（美）格里芬　著，张加楠　译', '山东画报出版社', '', 244, '2011-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (78, '建筑设计防火规范GB50016-2014', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 11, '', 'http://image12.bookschina.com/2019/20190918/1/s8167806.jpg', 124.80, 0, 99, '9787518201037', '中华人民共和国公安部', '', '', 685, '2013-06-07 00:00:00');
INSERT INTO `bms_book` VALUES (79, '图解建筑结构入门 ', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 11, '馨怡人，让你的房屋住起来更舒适、看起来更美观', 'http://image12.bookschina.com/2020/20200904/2/s8342211.jpg', 63.90, 0, 99, '9787553797656', '[日]原口秀昭 著；凤凰空间 出品', '江苏科学技术出版社', '', 320, '2020-06-01 00:00:00');
INSERT INTO `bms_book` VALUES (80, '住宅设计解剖书2', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 11, '本书是日本一级建筑师饭冢丰根据自己多年的实践经验，结合实际案例，总结出来的住宅设计基本原则和做法，以及*佳操作顺序。虽说是格局设计，但真正的工作从思考住宅用地就开始了。', 'http://image12.bookschina.com/2017/20170905/s7479690.jpg', 44.60, 0, 99, '9787544288262', '[日]饭冢丰 著', '南海出版公司', '', 171, '2017-05-01 00:00:00');
INSERT INTO `bms_book` VALUES (81, '大明王朝的七张面孔', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 2, '《大明王朝的七张面孔(插图版)》解读明朝历史人物，揭开人所共知的七个角色生命历程背后难为人知的艰辛、焦灼和不得已，分析其何以矛盾、扭曲和心力憔悴。这既是人在历史中的境况，也是其在文化中的境况。而这七张各不相同的面孔，构成了那个既强大又虚弱、既意志决绝又精神涣散的大明王朝的侧影。', 'http://image12.bookschina.com/2019/20190613/1/s8064929.jpg', 49.00, 0, 99, '9787563357437', '张宏杰 著,博集天卷 出品', '广东人民出版社', '', 335, '2006-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (82, '中国历史精神', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 2, '近代“史学四大家”之一，一代通儒钱穆经典作品，严谨与激情兼具，历史分析与现实关怀并重。', 'http://image12.bookschina.com/2020/20201008/5/s8381475.jpg', 23.90, 0, 99, '9787510812378', '钱穆', '贵州人民出版社', '', 199, '2012-02-01 00:00:00');
INSERT INTO `bms_book` VALUES (83, '半小时漫画中国史5', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 2, '中国史大结局！笑着笑着，大清就亡了！漫画科普开创者混子哥陈磊新作！其实是一本严谨的极简中国史！', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i1/2759802752/O1CN01yxCb7r1WCSbm8IRqn_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 48.90, 0, 99, '9787544389372', '陈磊 著;读客文化 出品', '文汇出版社', '', 248, '2019-11-01 00:00:00');
INSERT INTO `bms_book` VALUES (84, '古代人的日常生活', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 2, '古代的光棍多吗？古人怎么擦屁屁？古人夏天如何驱蚊？满足你对古人日常生活的全部好奇！', 'http://image12.bookschina.com/2019/20190905/3/s8159647.jpg', 62.90, 0, 99, '9787559435453', '讲历史的王老师 著；读客文化 出品', '江苏凤凰文艺出版社', '', 272, '2019-08-30 00:00:00');
INSERT INTO `bms_book` VALUES (85, '一读就上瘾的中国史', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 2, '在温伯陵笔下，历史不再是按时间码放的记事簿，而是贯通时间、看清脉络的时代演变过程。\n\n用他的方法来读历史，你将发现历史背后的那只手，彻底看懂历史的过去、现在和未来。', 'http://image12.bookschina.com/2020/20201009/1/s8371266.jpg', 41.20, 0, 99, '9787516826447', '温伯陵', '台海出版社', '', 376, '2020-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (86, '明朝那些事儿', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 2, '《明朝那些事儿》这篇文主要讲述的是从1344年到1644年这三百年间关于明朝的一些事情，以史料为基础，以年代和具体人物为主线，并加入了小说的笔法，对明朝十七帝和其他王公权贵和小人物的命运进行全景展示，尤其对官场政治、战争、帝王心术着墨最多，并加入对当时政治经济制度、人伦道德的演义。', 'http://image31.bookschina.com/2011/20111202/s5339387.jpg', 278.20, 0, 99, '9788721304621', '当年明月 著，磨铁图书 出品', '北京联合出版有限公司', '', 2072, '2011-12-01 00:00:00');
INSERT INTO `bms_book` VALUES (87, '万历十五年', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 2, '《万历十五年》是黄仁宇的成名之作，也是他的代表作之一。这本书融会了他数十年人生经历与治学体会，首次以“大历史观”分析明代社会之症结，观察现代中国之来路，给人启发良多。英文原本推出后，被美国多所大学采用为教科书，并两次获得美国书卷奖历史类好书的提名。', 'http://image31.bookschina.com/2018/zuo/1/s7641831.jpg', 18.70, 0, 99, '9787108009821', '黄仁宇', '生活.读书.新知三联书店', '', 320, '1997-05-01 00:00:00');
INSERT INTO `bms_book` VALUES (88, '故宫六百年', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 2, '去过故宫1000多次的史学大家阎崇年完整讲述故宫600年', 'http://image12.bookschina.com/2020/20200513/2/s8286854.jpg', 131.70, 0, 99, '9787507552713', '阎崇年', '华文出版社', '', 321, '2020-04-01 00:00:00');
INSERT INTO `bms_book` VALUES (89, '见识城邦・人类简史：从动物到上帝', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 2, '我们了解自己吗？我们过得更快乐吗？\n\n我们究竟希望自己得到什么、变成什么？', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/i2/2201514655578/O1CN01uCNazA1r4lpRESkdk_!!0-item_pic.jpg_580x580Q90.jpg', 40.80, 0, 99, '9787508647357', '[以色列] 尤瓦尔・赫拉利（Yuval Noah Harari）', '中信出版社', '', 440, '2014-11-01 00:00:00');
INSERT INTO `bms_book` VALUES (90, '中国通史', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 2, '易中天推崇的史学大师吕思勉的国史入门书，华人世界公认的权威国史巨著', 'http://image12.bookschina.com/2018/20181014/1/s7908731.jpg', 33.80, 0, 99, '9787532552795', '吕思勉　著', '民主与建设出版社', '', 466, '2009-04-01 00:00:00');
INSERT INTO `bms_book` VALUES (91, '半小时漫画中国史（番外篇）：中国传统节日', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 2, '屈原自己都过端午，清明原来不用扫墓。看半小时漫画，传统节日的来历瞬间一清二楚！', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/i1/459371288/O1CN01foqgp81LNwip4oi6Y_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 39.10, 0, 99, '9787539999883', '陈磊・半小时漫画团队 著；读客文化 出品', '海南出版社', '', 248, '2017-05-05 00:00:00');
INSERT INTO `bms_book` VALUES (92, '全球通史:从史前史到21世纪', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 2, '《全球通史》首开由历史学家运用全球观点囊括全球文明而编写的世界历史的先河。', 'http://image31.bookschina.com/2006/061020/s1670717.jpg', 91.00, 0, 99, '9787301204689', '（美）斯塔夫里阿诺斯  著，吴象婴  等译', '北京大学出版社', '', 223, '2019-10-01 00:00:00');
INSERT INTO `bms_book` VALUES (93, '枪炮、病菌与钢铁――人类社会的命运', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 2, '本书是理解人类社会发展史方面的一个重大进展，它记录了现代世界及其诸多不平等所以形成的原因，也是一部真正关于全世界各民族的历史，是对人类生活的完整一贯的叙述，娓娓道来，具有很强的可读性。', 'https://pic.baike.soso.com/ugc/baikepic2/47677/20160807033134-238737281.jpg/300', 34.70, 0, 99, '9787532739233', '[美]贾雷德・戴蒙德著 谢延光译', '上海译文出版社', '', 460, '2006-04-01 00:00:00');
INSERT INTO `bms_book` VALUES (95, '民国往事', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 2, '从非著名胡子到东北大帅，张作霖的人生路是怎样的华丽逆袭，皇姑屯的爆炸声又是一个何等卑劣的阴谋毒计？从私塾秀才到直系大将，牧野鹰扬、洛阳虎踞的吴佩孚有怎样的人生经历，又为何在直奉大战中众叛亲离？一代护国军神蔡锷是何等的风流倜傥，他和小凤仙的故事是确有其事还是民间的多情演义？本书精挑细选了一批代表人物和代表事件，真实再现了较为完整的民国人物活动事迹。该书文字简洁流畅，解读通俗易懂，图片精美，是一部适合大众阅读的历史通俗读物。', 'http://image12.bookschina.com/2019/20191223/2/s6907561.jpg', 12.10, 0, 99, '9787550250550', '萨沙 编', '北京联合出版公司', '', 256, '2015-05-04 00:00:00');
INSERT INTO `bms_book` VALUES (96, '半小时漫画中国史4', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 2, '五代十国的历史就像广场舞表演，各小国轮番上阵；大宋打仗常吃亏，但经济繁荣恢复快；元朝中期爱“宫斗”，38年换了9个皇帝……', 'http://image12.bookschina.com/2019/20190930/1/s8178628.jpg', 48.90, 0, 99, '9787544387866', '陈磊・半小时漫画团队 著；读客文化 出品', '海南出版社', '', 332, '2019-09-04 00:00:00');
INSERT INTO `bms_book` VALUES (97, '天朝的崩溃', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 2, '天朝的崩溃》是作者系统研究鸦片战争十余年所得的成果。作者详尽考订了与战争相关的一系列重要史实，力图以当时的道德观念、思维方式与行为规范去理解历史，使许多在今人看来是荒谬的现象得以显示其在当时环境中的“合理性”。同时，通过对有关人物及其言行活动分析，观察清王朝在历史转折关头的作为，揭示历史进程中的偶然与必然。鸦片战争在中国近代史上影响重大，有关著述已出版不少。这本书的研究可谓推陈出新，作者一系列独到创见可能在学术界引起争议，相信这种争议将有助于深化中国近代史研究', 'http://image12.bookschina.com/2015/20150207/s6707302.jpg', 42.40, 0, 99, '9787108022943', '茅海建　著', '生活・读书・新知三联书店', '', 600, '2005-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (98, '曾国藩的正面与侧面', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 2, '本书讲述了曾国藩跌宕起伏的一生，揭露了诸多不为人知的细节：一生遭遇过的五次重大挫折;与左宗棠的纠结和情谊;一生收入与支出;如何看待风水、相面、算卦和天命等。全书展示了一个正直、清廉、智慧的“圣人”形象的曾国藩，一个矛盾、挣扎的深嵌体制核心的职业官员。', 'http://image12.bookschina.com/2020/20200728/1/s8357325.jpg', 170.00, 0, 99, '9787513903318', '张宏杰 著,博集天卷 出品', '岳麓书社', '', 296, '2014-05-01 00:00:00');
INSERT INTO `bms_book` VALUES (99, '丝绸之路：一部全新的世界史', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 2, '关心一带一路，必读丝绸之路', 'http://image12.bookschina.com/2016/20161104/s7308133.jpg', 125.40, 0, 99, '9787308161459', '(英)彼得・弗兰科潘 著；读客文化 出品', '浙江大学出版社', '', 600, '2006-11-01 00:00:00');
INSERT INTO `bms_book` VALUES (100, '万古江河：中国历史文化的转折与开展', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 2, '在世界文明存在与变化的剧烈大潮之中，中国如何自处，如何看待自身的历史与文化？中国从何处来，中国文化从何处来，又要向何处去？', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i4/2049346548/O1CN01lNER1P1yF229CjcQQ_!!0-item_pic.jpg_580x580Q90.jpg', 40.80, 0, 99, '9787556116904', '许倬云 著，理想国 出品', '湖南人民出版社', '', 552, '2017-12-01 00:00:00');
INSERT INTO `bms_book` VALUES (101, '如何阅读一本书', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 10, '不懂阅读的人，初探阅读的人，读这本书可以少走冤枉路。对阅读有所体会的人，读这本书可以有更深的印证和领悟。', 'http://image12.bookschina.com/2015/20150221/s6721872.jpg', 31.70, 0, 99, '9787100040945', '[美]莫提默・J.艾德勒  查尔斯・范多伦 著，郝明义 朱衣 译', '商务印书馆', '', 376, '2004-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (102, '人性中的善良天使', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 10, '人是一种怎样的混合造物啊！新奇，古怪，混乱，自相矛盾，不可思议！他裁断世上万物，他是微末的蚯蚓、真理的宝库，灌满了谬误和不确定性的阴沟，宇宙的光荣和糟粕。', 'http://image12.bookschina.com/2015/20150409/s6945924.jpg', 96.00, 0, 99, '9787508650944', '斯蒂芬・平克', '中信出版社', '', 1044, '2015-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (103, '自由在高处', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 10, '《自由在高处》是作者对《重新发现社会》一书的重要补充。旨在从个体角度探讨身处转型期的人们如何超越逆境，盘活自由，拓展生存，积极生活。帕得里克说“不自由，毋宁死”，熊培云则说“不自由，仍可活”。自由与自救，是本书的方向与重点。', 'http://image12.bookschina.com/2015/20150206/s6769664.jpg', 39.80, 0, 99, '9787513301329', '熊培云', '新星出版社', '', 320, '2011-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (104, '跨越边界的社区：北京“浙江村”的生活史', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 10, '持续至今的真实“北漂”史。转型中的中国城市、流动人口、经济与社会。北京“浙江村”与“浙江村人”三十年生活记录研究。', 'http://image31.bookschina.com/2018/zuo/4/s7687275.jpg', 59.20, 0, 99, '9787807681885', '项飙', '生活.读书.新知三联书店', '', 560, '2018-03-01 00:00:00');
INSERT INTO `bms_book` VALUES (105, '乡下人的悲歌', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 10, '在《乡下人的悲歌》中，J.D. 万斯真实讲述了社会、地区和阶层衰落会给一生下来就深陷其中的人带来什么样的影响。万斯的外祖父母从肯塔基州的阿巴拉契亚地区向北迁居到俄亥俄州，希望逃离那可怕的贫穷。他们通过努力跻身中产阶层，最后他们的外孙从耶鲁法学院毕业，这是传统意义上成功实现一代人向上流动的标志。', 'http://image31.bookschina.com/2017/zuo/s7465102.jpg', 36.90, 0, 99, '9787559400857', 'J.D. 万斯 著  刘晓同 庄逸抒 译 时代华语 出品', '江苏凤凰文艺出版社', '', 264, '2017-04-01 00:00:00');
INSERT INTO `bms_book` VALUES (106, '国家的兴衰', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 10, '这部伟大著作的主题是：一个社会政治稳定的时间越长，就越可能发展起造成更低经济效率的强大特殊利益集团。', 'http://image12.bookschina.com/2018/20180510/s7660836.jpg', 58.80, 0, 99, '9787208146686', '曼瑟・奥尔森 著；李增刚 译', '上海人民出版社', '', 321, '2018-01-04 00:00:00');
INSERT INTO `bms_book` VALUES (107, '社会契约论', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 10, '《社会契约论》是一部政治哲学著作。它探讨的是政治权利的原理，它的主旨是为人民民主主权的建立奠定理论基础。', 'http://image31.bookschina.com/2018/zuo/5/s7532214.jpg', 17.20, 0, 99, '9787100037259', '[法]卢梭 著，李平沤 译', '商务印书馆', '', 197, '2003-03-01 00:00:00');
INSERT INTO `bms_book` VALUES (108, '大手笔是怎样炼成的', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 10, '做官是一门技术活，公文写作更是一门技术活。本书就是这门技术活的集大成之作。此书不是低层次简单的学习公文格式的条条框框，而是作者几十年的机关写作功底积累出来的丰富而实用的写作实战经验，是站在“大手笔”的高度教导如何写出有内容有价值的以文辅政的工作报告、调研报告、讲话稿。不是一堂枯燥无味的让人打瞌睡的理论课，而是一场耐人寻味、让人听得振奋人心、津津有味的报告会。', 'http://image12.bookschina.com/2015/20150725/s7093179.jpg', 124.90, 0, 99, '9787535462954', '谢亦森', '长江文艺出版社', '', 304, '2013-02-01 00:00:00');
INSERT INTO `bms_book` VALUES (109, '天空的另一半', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 10, '如果你认为教育的成本太高，试试看无知的代价', 'http://image12.bookschina.com/2018/20180521/s7737817.jpg', 26.50, 0, 99, '9787213086540', '(美) 尼可拉斯・D.克里斯多夫,(美) 雪莉・邓恩', '浙江人民出版社', '', 320, '2018-04-06 00:00:00');
INSERT INTO `bms_book` VALUES (110, '金枝', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 10, '本书着重研究原始人的宗教、巫术、仪式、心理与它们的教源，以及它们在人类思想方式发展进程中的重要作用。弗氏在这部作品中阐述的基本观点是：“人类较高级的思想活动，大体是巫术发展到宗教，更进而到科学的这几个阶段。”', 'http://image12.bookschina.com/2020/20200728/1/s8250895.jpg', 56.20, 0, 99, '9787100098144', '[英]J.G.弗雷泽', '重庆出版社', '', 1260, '2013-04-01 00:00:00');
INSERT INTO `bms_book` VALUES (111, '《华尔街日报》是如何讲故事的', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 10, '这本书解释了《华尔街日报》为什么产生了那么多令人惊叹的报道。', 'http://image12.bookschina.com/2018/20180509/s7679577.jpg', 30.90, 0, 99, '9787508039329', '（美）威廉・E・布隆代尔', '华夏出版社', '', 291, '2006-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (112, '树木之歌', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 10, '倾听树木，给我们提供了一种新的方式来剖析我们人类自己的本性，并理解生活在一个经历着深刻生态变化的世界中意味着什么。', 'http://image12.bookschina.com/2020/20201006/1/s8402667.jpg', 40.00, 0, 99, '9787100183291', 'David George Haskell', '商务印书馆', '', 306, '2020-07-07 00:00:00');
INSERT INTO `bms_book` VALUES (113, '研究是一门艺术', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 10, '撰写学术论文、调查报告、研究著作的权威指南', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/i1/1049653664/O1CN01dkAjlu1cw9kLSVpAD_!!0-item_pic.jpg_580x580Q90.jpg', 23.40, 0, 99, '9787501189045', '（美）布斯　等', '新华出版社', '', 204, '2009-08-01 00:00:00');
INSERT INTO `bms_book` VALUES (114, '通往奴役之路', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 10, '《通往奴役之路》一书在哈耶克的学术生涯中占有极其重要地位，这本书为他赢得广泛的注意，他的世界性声誉就是由此奠定的。他在这本书中论证道，当时正在计划中的福利国家不是为个人自由的战斗在和平时期的继续，倒是朝着专制的方向迈出了一步。', 'https://g-search2.alicdn.com/img/bao/uploaded/i4/i4/2462285077/O1CN01BpsKsd1nNJS6zE3Pp_!!0-item_pic.jpg_580x580Q90.jpg', 36.10, 0, 99, '9787500421368', '现实的社会建构：知识社会学论纲', '彼得・伯格', '', 247, '1997-08-01 00:00:00');
INSERT INTO `bms_book` VALUES (115, '暗网', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 10, '全面深入揭秘“黑暗版淘宝”暗网的幕后世界和操纵者', 'http://image12.bookschina.com/2018/20180822/s7823696.jpg', 47.20, 0, 99, '9787569923308', '[英]杰米・巴特利特著，刘丹丹译', '北京时代华文书局', '', 400, '2018-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (116, '小镇喧嚣：一个乡镇政治运作的演绎与阐释', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 10, '基层迎检、开发纷争、征收税费、产业调整、征地“种房”、维权争利……“喧嚣”一词，释尽乡镇日常政治种种人事与结构交织碰撞的众声嘈杂。本书以后现代叙事策略，围绕基层政权、村级组织和农民在复杂的乡村权力场域中博弈共生的过程和状况，深度阐释了21世纪初中国中部地区某乡镇“乡域政治”的运作实践与支配逻辑。', 'http://image12.bookschina.com/2018/20180525/s7687276.jpg', 59.20, 0, 99, '9787807682158', '吴毅', '生活.读书.新知三联书店', '', 640, '2018-02-01 00:00:00');
INSERT INTO `bms_book` VALUES (117, '人是如何学习的:大脑、心理、经验及学校', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 10, '当今世界正面临着一场“学习的革命”，我们将彻底改革几个世纪以来人们已经习以为常的、旧的、传统的教育观念和教学模式，创造出一种在真正意义上尊重人的主体性、激发人的创造性、相信并注意开发人的潜力、便于人与人交际与合作的崭新的教育观念和学习模式。人们对有效学习的观念已经发生了根本性的变化，教学研究的重点已从如何教转向如何学，从结果转向过程，从机械操练转向知识的理解和运用。学生不再被看成是接受知识的容器，而是知识的建构者和生成者。', 'http://image12.bookschina.com/2013/20130310/s5753470.jpg', 28.90, 0, 99, '9787561798270', '[美]布兰思福特等　编著,程可拉　等译', '华东师范大学出版社', '', 346, '2013-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (118, '风险社会：新的现代性之路', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 10, '德国社会学家乌尔里希·贝克经典作品，洞悉人类生存困境，提出“风险社会”的重要诊断。', 'http://image31.bookschina.com/2018/zuo/3/s7724323.jpg', 53.70, 0, 99, '9787544770620', '乌尔里希・贝克 著，张文杰 何博闻 译', '译林出版社', '', 351, '2018-02-01 00:00:00');
INSERT INTO `bms_book` VALUES (119, '中国人行动的逻辑', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 10, '“社会学经典文库”《中国人行动的逻辑》2017修订新版，中国人特有心理与行动在全球化与互联网时代来临前的“史前史”，解读“名实分离”的中国人。', 'http://image12.bookschina.com/2018/20180525/s7687234.jpg', 41.80, 0, 99, '9787807681816', '翟学伟', '生活.读书.新知三联书店', '', 302, '2017-10-01 00:00:00');
INSERT INTO `bms_book` VALUES (120, '权力与特权: 社会分层的理论', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 10, '《权力与特权》主要回答了社会分层领域中的核心问题：谁得到了什么？为什么能够得到？格尔哈特•伦斯基通过辩证的视角来审视这一学科思想的的发展，勾勒了正在兴起的理论综合的框架。他认为众多社会学家——如马克思、斯宾塞、萨姆纳、凡勃伦、莫斯卡、帕累托、索罗金、帕森斯和达伦多夫—— 所持的多元、矛盾的观点都可以被包含于不断发展的、系统化的理论主体当中。', 'http://image31.bookschina.com/2018/zuo/4/s7688913.jpg', 69.00, 0, 99, '9787520112178', '[美] 格尔哈特.伦斯基 著', '社会科学文献出版社', '', 656, '2018-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (121, '高等数学（第七版）（上册）', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 7, '《高等数学·上册》包括函数与极限、导数与微分、微分中值定理与导数的应用、不定积分、定积分及其应用、微分方程等内容，书末还附有二阶和三阶行列式简介、基本初等函数的图形、几种常用的曲线、积分表、习题答案与提示。https://g-search3.alicdn.com/img/bao/uploaded/i4/i1/617939881/O1CN01aydyap2MrYAiEKwcF_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i1/617939881/O1CN01aydyap2MrYAiEKwcF_!!0-item_pic.jpg_580x580Q90.jpg', 38.60, 0, 99, '9787040396638', '同济大学数学系', '高等教育出版社', '', 427, '2014-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (122, '高等数学（第七版）（下册）', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 7, '《\"十二五\"\"普通高等教育本科国家 级规划教材:高等数学(下册)(第七版)》内容深广度符合“工科类本科数学基础课程教学基本要求”，适合高等院校工科类各专业学生使用。《\"\"十二五\"\"普通高等教育本科国家 级规划教材:高等数学(下册)(第七版)》包括向量代数与空间解析几何、多元函数微分法及其应用、重积分、曲线积分与曲面积分、无穷级数等内容，书末还附有习题答案与提示。\"', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/i1/920532117/O1CN01nE7v8u1RVd4oR7bHf_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 31.80, 0, 99, '9787040396621', '同济大学数学系', '高等教育出版社', '', 358, '2014-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (123, '怎样解题--数学思维的新方法', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 7, '《怎样解题：数学思维的新方法》这本经久不衰的畅销书出自一位数学家G.波利亚的手笔，虽然它讨论的是数学中发现和发明的方法和规律，但是对在其他任何领域中怎样进行正确思维都有明显的指导作用。本书围绕“探索法”这一主题，采用明晰动人的散文笔法，阐述了求得一个证明或解出一个未知数的数学方法怎样可以有助于解决任何“推理”性问题——从建造一座桥到猜出一个字谜。一代又一代的读者尝到了本书的甜头，他们在本书的指导下，学会了怎样摒弃不相干的东西，直捣问题的心脏。\n', 'http://image12.bookschina.com/2018/20181003/1/s7898325.jpg', 27.80, 0, 99, '9787542843876', '(美)G.波利亚', '上海科技教育出版社', '', 213, '2007-05-01 00:00:00');
INSERT INTO `bms_book` VALUES (124, '高等数学习题全解指南（上册）同济 第七版', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 7, '解读考研大纲，图解本章知识要点，归纳常考点，解答学习中的疑难问题；', 'http://image12.bookschina.com/2015/20150409/s6925436.jpg', 39.00, 0, 99, '9787544163408', '同济大学数学系', '高等教育出版社', '', 346, '2015-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (125, '普林斯顿微积分读本（修订版）', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 7, '本书阐述了求解微积分的技巧, 详细讲解了微积分基础、极限、连续、微分、导数的应用、积分、无穷级数、泰勒级数与幂级数等内容，旨在教会读者如何思考问题从而找到解题 所需的知识点, 着重训练大家自己解答问题的能力.', 'http://image12.bookschina.com/2016/20161104/s7311908.jpg', 67.30, 0, 99, '9787115435590', '【美】阿德里安・班纳', '人民邮电出版社', '', 668, '2016-10-01 00:00:00');
INSERT INTO `bms_book` VALUES (126, '高等数学习题全解指南（下册）同济 第七版', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 7, '', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i3/787562409/O1CN01VzDeLp1TfMks5LYWt_!!0-item_pic.jpg_580x580Q90.jpg', 33.80, 0, 99, '9787517026235', '同济大学数学系', '高等教育出版社', '', 377, '2014-10-01 00:00:00');
INSERT INTO `bms_book` VALUES (127, '天真的人类学家', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 7, '本书的独特之处在于以一种学术作品罕见的软性触角，以一种英国式幽默风趣的笔调彻底摧毁了田野工作的美丽幻想，将隐匿于严肃人类学专著背后的鲜活经历与感触一一呈现给读者。\n', 'http://image12.bookschina.com/2020/20201112/1/s8429927.jpg', 21.00, 0, 99, '9787208042988', '奈吉尔・巴利(Nigel・Barley) 著，理想国 出品', '广西师范大学出版社', '', 195, '2003-08-01 00:00:00');
INSERT INTO `bms_book` VALUES (128, '地理学与生活', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 7, '地理学是一门古老的学科，最初仅指地球的绘图与勘查，但发展到今天已经逐渐成为一门范围广泛的学科。本书共十三章，分四篇，囊括自然地理学、人口地理学、文化地理学、城市地理学等分支学科。全书以介绍地理学的发展、核心概念，以及四种系统性传统为开端，四大传统独立成篇。前三篇专门介绍地理学的分支学科，而区域分析传统作为全书最后一篇，利用前三种传统和主题，并通过相互参照对其进行综合。', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/i4/927356304/TB1x8SdiYorBKNjSZFjXXc_SpXa_!!0-item_pic.jpg_580x580Q90.jpg', 218.90, 0, 99, '9787550294455', '[美]阿瑟・格蒂斯、朱迪丝・格蒂斯、杰尔姆・D.费尔曼  后浪', '北京联合出版公司', '', 544, '2017-04-01 00:00:00');
INSERT INTO `bms_book` VALUES (129, '几何原本', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 7, '建立空间秩序久远权威的逻辑推测语系', 'http://image12.bookschina.com/2019/20190613/1/s8069238.jpg', 40.00, 0, 99, '9787544722841', '（古希腊）欧几里得 著，燕晓东 译，凤凰联动 出品', '江苏人民出版社', '', 640, '2011-11-04 00:00:00');
INSERT INTO `bms_book` VALUES (130, '概率论与数理统计(第4版)', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 7, '《概率论与数理统计(第4版)》是普通高等教育“十一五”国家级规划教材，在2001年出版的《概率论与数理统计(第4版)》（第三版）的基础上增订而成。本次修订新增的内容有：在数理统计中应用Excel，bootstrap方法，户值检验法，箱线图等；同时吸收了国内外优秀教材的优点对习题的类型和数量进行了调整和充实。', 'http://image12.bookschina.com/2012/20120216/s5387819.jpg', 38.40, 0, 99, '9787040238969', '浙江大学 盛骤 谢式千 潘承毅', '高等教育出版社', '', 414, '2010-10-01 00:00:00');
INSERT INTO `bms_book` VALUES (131, '公司理财(原书第11版)', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 7, '全书共分概论，估值与资本预算，风险，资本结构与股利政策，长期融资，期权、期货与公司理财，短期财务，理财专题八大篇三十一章，全面梳理了现代金融学的理论体系，重点讲解了套利定价理论、有效资本市场与行为金融、杠杆企业的估值与资本市场以及财务困境等内容，所有的金融理论概念均从公司财务管理的角度阐述，强调金融理论的现实指导性！', 'http://image12.bookschina.com/2018/20180520/s7740322.jpg', 85.70, 0, 99, '9787111574156', '[美]斯蒂芬 A. 罗斯（Stephen A. Ross）等', '机械工业出版社', '', 665, '2017-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (132, '教育学基础 第3版', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 7, '高等师范院校公共课教育学教材', 'http://image12.bookschina.com/2018/20180715/1/s7514190.jpg', 31.80, 0, 99, '9787511402011', '全国十二所重点师范大学', '教育科学出版社', '', 237, '2010-03-01 00:00:00');
INSERT INTO `bms_book` VALUES (133, '怎样解题：数学思维的新方法', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 7, '《怎样解题：数学思维的新方法》这本经久不衰的畅销书出自一位著名数学家 G·波利亚的手笔，虽然它讨论的是数学中发现和发明的方法和规律，但是对在其他任何领域中怎样进行正确思维都有明显的指导作用。《怎样解题：数学思维的新方法》围绕“探索法”这一主题，采用明晰动人的散文笔法，阐述了求得一个证明或解出一个未知数的数学方法怎样可以有助于解决任何“推理”性问题——从建造一座桥到猜出一个字谜。一代又一代的读者尝到了本书的甜头，他们在本书的指导下，学会了怎样摒弃不相干的东西，直捣问题的心脏。', 'http://image12.bookschina.com/2018/20181003/1/s7898325.jpg', 47.80, 0, 99, '9787542852311', '(美)G.波利亚', '上海科技教育出版社', '', 231, '2011-12-30 00:00:00');
INSERT INTO `bms_book` VALUES (134, '投资学（原书第10版）', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 7, '本书由三名美国知 名学府的金融学教授撰写的著作，是美国好的商学院和管理学院的首 选教材。全书详细讲解了投资领域中的风险组合理论、资本资产定价模型、套利定价理论、市场有效性、证券评估、衍生证券、资产组合管理等重要内容。本书适用于金融专业高年级本科生、研究生及MBA学生，金融领域的研究人员与从业者', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i3/859515618/TB1BTtPaER1BeNjy0FmXXb0wVXa_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 92.90, 0, 99, '9787111568230', '（美）滋维・博迪（Zvi Bodie）', '机械工业出版社', '', 322, '2018-04-13 00:00:00');
INSERT INTO `bms_book` VALUES (135, '费曼物理学讲义:新千年版（第1卷）', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 7, '本书为量子力学，系美国著名物理学家为本科生所作的演讲。本书共分三卷，第一卷包括力学、相对论、光学、气体分子运动理论、热力学、波等。第二卷主要是电磁学，第三卷为量子力学。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i3/859515618/O1CN016Nf3Ti1rN5hfjKIaF_!!0-item_pic.jpg_580x580Q90.jpg', 105.00, 0, 99, '9787547816387', '[美]费曼(Richard Feynman)、[美]莱顿(Robert Leighton)、[美]桑兹(Matthew Sands)', '上海科学技术出版社', '', 190, '2013-05-01 00:00:00');
INSERT INTO `bms_book` VALUES (136, '九章算术', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 7, '人类科学史上应用数学的最早巅峰', 'http://image12.bookschina.com/2020/20200828/1/s8374104.jpg', 33.80, 0, 99, '9787214067296', '（汉）张苍 等 著， 曾海龙 译，凤凰联动出品', '江苏人民出版社', '', 317, '2011-03-01 00:00:00');
INSERT INTO `bms_book` VALUES (137, '普林斯顿概率论读本', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 7, '本书知识面广博，并且用清晰、轻松的语言来阐释高度形式化的问题，仿一位循循善诱的教授在耐心讲述。对于学习传统教材的学生而言，本书是非常好的补充。本书不仅值得在教育界推广，也适合统计学家用于探究他们死记硬背下来的基本定理。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i1/2780943040/O1CN01ss2tBP1YKMfAqfPWu_!!0-item_pic.jpg_580x580Q90.jpg', 107.20, 0, 99, '9787115543776', '[美] 史蒂文・J. 米勒（Steven J. Miller）', '人民邮电出版社', '', 732, '2020-08-01 00:00:00');
INSERT INTO `bms_book` VALUES (138, '中国现代文学三十年(修订本)', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 7, '', 'http://image12.bookschina.com/2018/20180713/2/s7530259.jpg', 51.70, 0, 99, '9787561246726', '钱理群,温儒敏等', '北京大学出版社', '', 310, '2015-11-10 00:00:00');
INSERT INTO `bms_book` VALUES (139, '物种起源', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 7, '《物种起源》所阐述的进化论是19世纪自然科学的三大发现之一，被誉为“影响世界历史进程的书”', 'http://image12.bookschina.com/2014/20140826/s6640577.jpg', 103.70, 0, 99, '9787544741323', '查尔斯・达尔文 著，苗德岁 译', '译林出版社', '', 339, '2013-10-01 00:00:00');
INSERT INTO `bms_book` VALUES (140, '相对论', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 7, '人类智识史和人类文明史上划时代的丰碑,一部广为流传的科学经典', 'http://image12.bookschina.com/2020/20200917/1/s8069240.jpg', 32.00, 0, 99, '9787200069723', '爱因斯坦 著，曹天华 译', '新世界出版社', '', 159, '2017-09-01 00:00:00');
INSERT INTO `bms_book` VALUES (141, '你当像鸟飞往你的山', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 12, '多一个人读到这个真实故事，就多一个人勇敢做自己！', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i3/2113490199/O1CN01IOU5x11DLBSR7ZCOk_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 59.00, 0, 99, '9787544276986', '塔拉 ・ 韦斯特弗  著 ， 新经典  出品', '南海出版公司', '', 388, '2019-10-20 00:00:00');
INSERT INTO `bms_book` VALUES (142, '万般滋味，都是生活', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 12, '愿你永葆童真，并乐此不疲，去生活', 'http://image31.bookschina.com/2019/zuo/8/s7934026.jpg', 35.40, 0, 99, '9787568039390', '丰子恺', '华中科技大学出版社', '', 248, '2018-09-01 00:00:00');
INSERT INTO `bms_book` VALUES (143, '皮囊', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 12, '直面人生的终极问题，刻在骨头里的故事，容纳一个个既失去家乡又未到达远方的生命。', 'http://image12.bookschina.com/2019/20190607/2/s8088021.jpg', 47.20, 0, 99, '9787201088945', '蔡崇达，果麦文化 出品', '天津人民出版社', '', 264, '2014-12-01 00:00:00');
INSERT INTO `bms_book` VALUES (144, '沉默的大多数', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 12, '自从我辈成人以来，所见到的一切全是颠倒着的。在一个喧嚣的话语圈下面，始终有个沉默的大多数。——王小波', 'http://image12.bookschina.com/2018/20180406/s7388008.jpg', 24.10, 0, 99, '9787530216590', '王小波 著，新经典 出品', '北京十月文艺出版社', '', 216, '2017-04-01 00:00:00');
INSERT INTO `bms_book` VALUES (145, '我喜欢生命本来的样子', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 12, '周国平经典散文作品集', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i3/2881158695/O1CN01yIr5512E6MQqhtUau_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 40.10, 0, 99, '9787506391542', '周国平', '作家出版社', '', 304, '2017-03-01 00:00:00');
INSERT INTO `bms_book` VALUES (146, '人间词话', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 12, '近代极富盛名的词话著作，集编、校、释、评于一体，赏读于一书', 'http://image12.bookschina.com/2018/20180308/s7835245.jpg', 23.20, 0, 99, '9787532524808', '王国维　著', '北京联合出版公司', '', 78, '1998-12-01 00:00:00');
INSERT INTO `bms_book` VALUES (147, '可能这就是人生吧', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 12, '人民日报、十点读书推荐，文学泰斗梁实秋趣味散文选，创作100周年特别纪念', 'https://i01piccdn.sogoucdn.com/99998ab42c06f5e9', 39.00, 0, 99, '9787505749153', '梁实秋 著  时代华语 出品', '中国友谊出版公司', '', 256, '2020-08-01 00:00:00');
INSERT INTO `bms_book` VALUES (148, '一只特立独行的猪', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 12, '这本书里除了文化杂文，还有给其他书写的序言与跋语。这些序言与跋语也表明了我的一些态度。除此之外，还有一些轻松的随笔。不管什么书，我都不希望它太严肃，这一本也不例外。', 'http://image12.bookschina.com/2018/20180608/s7813264.jpg', 24.10, 0, 99, '9787531719199', '王小波 著，新经典 出品', '北京十月文艺出版社', '', 256, '2006-04-01 00:00:00');
INSERT INTO `bms_book` VALUES (149, '夜航船', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 12, '年轻人要熟知的4248个文化常识！贾平凹题名版！读过《夜航船》，灵魂才有趣！', 'http://image31.bookschina.com/2016/zuo/s7157177.jpg', 83.20, 0, 99, '9787533954109', '[明] 张岱 著，作家榜经典 出品，何三坡 译，贾平凹 荐，大星文化', '浙江文艺出版社', '', 393, '2018-11-01 00:00:00');
INSERT INTO `bms_book` VALUES (150, '你是人间四月天', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 12, '一代才女林徽因在文学上著述不多，本书精选其诗歌、小说、散文佳作。其作品自有女性的温婉清丽，但并不为小格局所囿。她并非不食人间烟火的娇弱女子，笔下流露出令人惊讶的对民间百态的深谙，实有创作天赋。书中选配相关图片近200幅，栩栩如生地反映林徽因及其家人、友人的风貌。这位秀外慧中的民国女子，早已化为一代传奇，于历史中定格为“人间的四月天”。', 'http://image12.bookschina.com/2015/20150219/s6745858.jpg', 22.40, 0, 99, '9787505950740', '林徽因　著', '北京联合出版公司', '', 253, '2005-12-01 00:00:00');
INSERT INTO `bms_book` VALUES (151, '撒哈拉的故事', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 12, '三毛作品中最脍炙人口的《撒哈拉的故事》，由12篇精彩动人的散文结合而成，其中《沙漠中的饭店》，是三毛适应荒凉单调的沙漠生活后，重新拾笔的第一篇文字，自此之后，三毛便写出一系列以沙漠为背景的故事，倾倒了全世界的中文读者。', 'http://image31.bookschina.com/2017/zuo/s7455965.jpg', 35.00, 0, 99, '9787806398791', '三毛 著，新经典 出品', '北京十月文艺出版社', '', 217, '2003-08-01 00:00:00');
INSERT INTO `bms_book` VALUES (152, '目送', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 12, '龙应台“人生三书”之三', 'http://image12.bookschina.com/2014/20140604/s6460348.jpg', 25.80, 0, 99, '9787108032911', '龙应台 著，理想国 出品', '广西师范大学出版社', '', 281, '2009-10-01 00:00:00');
INSERT INTO `bms_book` VALUES (153, '月光落在左手上', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 12, '一个无法劳作的脑瘫患者，却有着常人莫及的语言天才。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i4/839616086/O1CN01IW3KVG1upR30sAHnC_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 43.50, 0, 99, '9787549563494', '余秀华  著 ， 新经典  出品', '北京十月文艺出版社', '', 256, '2015-02-01 00:00:00');
INSERT INTO `bms_book` VALUES (154, '自在独行 贾平凹的独行世界', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 12, '对于匆匆的路人，平凹先生这部文集只是用来附庸风雅的玩物。但这本书却要写给生命的行者。愿他们能懂得孤独的真义，在生活里多一些从容潇洒。\n', 'https://i01piccdn.sogoucdn.com/1afa52ad1e0f8cea', 36.20, 0, 99, '9787535488473', '贾平凹 著 时代华语 出品', '长江文艺出版社', '', 320, '2016-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (155, '家人闲坐，灯火可亲', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 12, '愿你有家可回，有人可等。三餐有味，四季有景', 'http://image12.bookschina.com/2020/20200707/2/s8296231.jpg', 39.20, 0, 99, '9787554616079', '汪曾祺著，文通天下 出品', '光明日报出版社', '', 288, '2020-11-01 00:00:00');
INSERT INTO `bms_book` VALUES (156, '浮生六记', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 12, '沈复给芸娘的绝美情书', 'http://image12.bookschina.com/2019/20190710/1/s8112113.jpg', 30.40, 0, 99, '9787020028313', '沈复 著 ， 张佳玮 译，果麦文化 出品', '天津人民出版社', '', 80, '1999-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (157, '我与地坛', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 12, '收有“午餐半小时”、“我的遥远的清平湾”、“命若琴弦”、“第一人称”、“两个故事”等15篇史铁生的代表作。', 'http://image31.bookschina.com/2018/zuo/5/s7727633.jpg', 16.00, 0, 99, '9787531324362', '史铁生', '人民文学出版社', '', 399, '2002-05-01 00:00:00');
INSERT INTO `bms_book` VALUES (158, '人间岁月长', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 12, '本书是国学大师、北京大学终身教授季羡林留给彷徨者的礼物。这是季羡林的散文精选集，也是先生九十多年人生智慧的总结和心灵独白。', 'http://image12.bookschina.com/2021/20210114/1/s8390850.jpg', 37.90, 0, 99, '9787514512618', '季羡林', '中国致公出版社', '', 255, '2020-03-01 00:00:00');
INSERT INTO `bms_book` VALUES (159, '心安即是归处', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 12, '季羡林百年生命智慧。央视《朗读者》多次动情朗读本书名篇，贾平凹、白岩松、金庸、林青霞诚意推荐', 'http://image12.bookschina.com/2020/20200905/2/s8318851.jpg', 9.90, 0, 99, '9787554615430', '季羡林', '古吴轩出版社', '', 260, '2012-02-01 00:00:00');
INSERT INTO `bms_book` VALUES (160, '人间告白', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 12, '花生妈妈金鱼酱写给儿子的信', 'http://image31.bookschina.com/2020/zuo/4/s8269948.jpg', 44.80, 0, 99, '9787550035652', '金鱼酱  白马时光出品', '百花洲文艺出版社', '', 156, '2020-03-01 00:00:00');
INSERT INTO `bms_book` VALUES (161, '中国舞蹈发展史', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '本书是一部阐述中国舞蹈发展史的专题学术著作。', 'https://mmbiz.qpic.cn/mmbiz_jpg/4SALlRAeVUDOhukBGBCjYslAAUGjl7tYUQg4LgndQQ7KJve0wicRkqicjIXt41z21lb5dWEyj6n74YZhn8kHcxuw/640?wx_fmt=jpeg&tp=webp&wxfrom=5&wx_lazy=1&wx_co=1', 50.60, 0, 99, '9787208053014', '王克芬　著', '武汉大学出版社', '', 132, '2005-06-01 00:00:00');
INSERT INTO `bms_book` VALUES (162, '舞蹈知识200问', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '本书作者琚军红多年来讲授《音乐鉴赏》《舞蹈艺术鉴赏》《交响音乐鉴赏》等课程。本书系“音乐知识系列”读物的延续出版，总体框架分三部分：舞蹈综述、舞蹈欣赏、古代舞蹈家的故事。在大的框架中以点为基线，用问答的形式对中国从古至今的舞蹈知识进行了系统、简要的讲述。', 'http://image12.bookschina.com/2016/20161225/s7283248.jpg', 31.40, 0, 99, '9787555903154', '琚军红', '河南文艺出版社', '', 247, '2016-10-01 00:00:00');
INSERT INTO `bms_book` VALUES (163, '舞蹈知识手册', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '舞蹈知识学习手册参考资料工具书籍', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/i1/1049653664/O1CN01sfHaAH1cw9etuNY4v_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 77.40, 0, 99, '9787805537511', '隆萌培、 徐尔充', '上海音乐出版社', '', 606, '1999-04-01 00:00:00');
INSERT INTO `bms_book` VALUES (164, '素质教育舞蹈', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '《素质教育舞蹈》是我国第一本“素质教育舞蹈”的教材和教学法。舞蹈课以“课例”形式呈现，说明这与任何传统舞蹈教育都不同，将一改历史上一直沿用的专业舞蹈教育教学模式，故而必须从头做起。因此，这本书必须将它的理论根源、理念、教学方法、教材编制的标准与方法、上课的标准与具体任务、评价方法等形成一个有机整体，所以并不简单只是一本教材和教学法。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i1/2063472301/O1CN01ooWq9h1SrtwTKjWft_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 53.70, 0, 99, '9787552305920', '吕艺生', '上海音乐出版社', '', 268, '2014-12-01 00:00:00');
INSERT INTO `bms_book` VALUES (165, '舞蹈艺术概论', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '《舞蹈艺术概论(修订版)》自1997年出版以来，受到广大舞者和舞蹈爱好者的欢迎和厚爱，北京和各省市的很多艺术院校舞蹈系把它作为舞蹈理论课程的教材。1998年10月获第十一届华东地区优秀文艺图书二等奖。', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/i3/2208152879297/O1CN01ROnu5F2IY4rSIGaUh_!!2208152879297.jpg_580x580Q90.jpg_.webp', 69.50, 0, 99, '9787805536255', '隆荫培  徐尔充', '上海音乐出版社', '', 606, '1997-04-01 00:00:00');
INSERT INTO `bms_book` VALUES (166, '當代舞蹈的心跳', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '好舞蹈，如何好？如何看？等待已久的第一本當代舞蹈圖文全書', 'http://7110147.s21i.faiusr.com/2/ABUIABACGAAgwujEswUonNf0vgQw1gE4lAI.jpg', 395.00, 0, 99, '9789866408601', '菲利普·努瓦泽特', '上海人民出版社', '', 317, '2012-08-30 00:00:00');
INSERT INTO `bms_book` VALUES (167, '芭蕾圣经', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '本书涉及的人物林林总总，既有先驱者的如雷贯耳的名字，也有大批后起之秀，其中包括诺维尔、维斯特里、彼季帕、布农维尔、巴兰钦、罗宾斯、撒普、贝雅尔等编舞家，巴赫、马斯奈、柴科夫斯基、斯特拉文斯基、伯恩斯坦等音乐…', 'http://image12.bookschina.com/2015/20150506/s6994407.jpg', 77.40, 0, 99, '9787542652577', '（美）乔治・巴兰钦，（美）费朗西斯・梅森　著，管可��　译', '上海三联书店', '', 844, '2015-08-01 00:00:00');
INSERT INTO `bms_book` VALUES (169, '动作的瞬间：舞蹈即兴', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '本书适用于对即兴或者对普遍创作过程感兴趣的读者，同时也为那些对抽象、审美、舞蹈理论等感兴趣的读者而写。', 'http://image12.bookschina.com/2016/20161222/s7365469.jpg', 37.30, 0, 99, '9787547716281', '(美) 布洛姆,，(美) 卓别林 著，赵知博 译', '北京日报出版社（原同心出版社）', '', 352, '2016-12-01 00:00:00');
INSERT INTO `bms_book` VALUES (171, '田培培告诉你学习舞蹈的100个秘密', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '《田培培告诉你学习舞蹈的100个秘密》是一本具有参考性、实用性的舞蹈学习工具书。其内容分为“舞蹈表现力的秘密”、“舞蹈基本功的秘密”、“舞蹈技巧的秘密”、“舞蹈求学者的秘密”、“舞台舞蹈表现失误补救的秘密”五大部分及100个有关舞蹈学习的基本知识，为舞蹈教师、学习舞蹈的学生及其家长们解开台前幕后的面纱，期待让更多的人近距离接触舞蹈并热爱舞蹈。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i2/302405433/O1CN01HoNN4A1q0MTmo5NxG_!!302405433.jpg_580x580Q90.jpg_.webp', 26.10, 0, 99, '9787544259934', '田培培　编', '南海出版公司', '', 214, '2012-08-11 00:00:00');
INSERT INTO `bms_book` VALUES (172, '芭蕾之书：青少年芭蕾舞指南', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '作为一本芭蕾舞学习工具书，《芭蕾之书——青少年芭蕾舞指南》在视觉上赏心悦目。全书图文并茂，通过大量彩色照片生动展示了古典芭蕾的基本舞姿，由一群充满活力的少年舞者演示手臂、脚和身体位置的术语以及跳跃、行进等动作过程。', 'http://image12.bookschina.com/2020/20200831/1/s8362516.jpg', 109.00, 0, 99, '9787542667816', '（加）黛博拉・鲍尔斯', '上海三联书店', '', 276, '2020-05-01 00:00:00');
INSERT INTO `bms_book` VALUES (173, '舞蹈力量训练原理与方法 ', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '《舞蹈力量训练原理与方法》的内容就是整合上述各项研究成果，提出了舞蹈力量类型划分理论，根据舞蹈功能性力量和技术性力量的类型特点，筛选出多种有针对性的训练方法，并进行训练原理的阐述。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i2/2207584012303/O1CN01vc5hjv1SsojDgfGxp_!!2207584012303.jpg_580x580Q90.jpg_.webp', 43.40, 0, 99, '7552300175', '杨鸥', '上海音乐出版社', '', 241, '2012-09-01 00:00:00');
INSERT INTO `bms_book` VALUES (174, '中小学民族民间舞蹈特色教材・高级篇', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '本书主要介绍了藏族、蒙古族、维吾尔族等十个民族的民俗文化、舞蹈常识，以及各民族舞蹈的典型特征，同时针对学生层次，收录了十段完整的舞蹈组合视频并进行了详细讲解。本书面向初中舞蹈教师以及从事舞蹈教学的培训机构，可作为初中二、三年级学生舞蹈教学的教材，同时对从事舞蹈研究的学者以及喜爱舞蹈的家长也有较高的参考价值。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i2/1049653664/TB1dRHJoN1YBuNjy1zcXXbNcXXa_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 43.40, 0, 99, '9787302495826', '杨敏、刘瑞娟、魏逢、林青', '清华大学出版社', '', 269, '2018-04-01 00:00:00');
INSERT INTO `bms_book` VALUES (175, '舞蹈家自我修养', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '本书尽可能全面地收集伊莎多拉·邓肯一生中关于舞蹈、关于艺术、关于女性、关于生命的思考文字。舞蹈对于邓肯而言，不仅是一种戏剧的、音乐的艺术，更是一种宗教的、生命的艺术，它来自于自然而且还是历史传统的一部分。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i1/2041592426/O1CN01GaxJS11Tn9SuPgAd1_!!2041592426-0-lubanu-s.jpg_580x580Q90.jpg_.webp', 52.10, 0, 99, '9787568044578', '[美]伊莎多拉・邓肯', '华中科技大学出版社', '', 224, '2018-11-01 00:00:00');
INSERT INTO `bms_book` VALUES (176, '中国舞蹈批评', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '《中国舞蹈批评》是一部系统研究中国舞蹈批评历史和现状的专著，即“中国舞蹈批评的批评”，在写作上体现为“史论评”的充分整合。', 'https://g-search2.alicdn.com/img/bao/uploaded/i4/i3/859515618/O1CN01D349qD1rN5iYFQLlR_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 93.20, 0, 99, '9787552319200', '慕羽', '上海音乐出版社', '', 613, '2020-08-01 00:00:00');
INSERT INTO `bms_book` VALUES (177, '少儿形体模特艺术教程', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '本书是艺鑫文化公司特色课程“形体模特表演艺术”的教学用书，内容主要侧重培养少儿形体艺术及服装表演技巧。形体模特课程着力提高儿童素质教育，提升儿童形象气质，融汇现代服装表演技巧。', 'https://g-search2.alicdn.com/img/bao/uploaded/i4/i3/1049653664/O1CN01coyPzv1cw9nxVPucl_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 53.70, 0, 99, '9787566916709', '艺鑫文化', '东华大学出版社', '', 214, '2019-11-01 00:00:00');
INSERT INTO `bms_book` VALUES (178, '中国古典舞身韵教学法', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '《中国古典舞身韵教学法》是唐满城教授在北京舞蹈学院历届中国舞系教育专业授课实践中逐步完善而成的教材。其宗旨是把身韵教学积累的宝贵经验转化为一种科学的教学规律和方法。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i3/725677994/O1CN01Pi00S528vInWWHUXf_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 43.40, 0, 99, '9787806675977', '唐满城  金浩', '上海音乐出版社', '', 218, '2004-09-01 00:00:00');
INSERT INTO `bms_book` VALUES (179, '中国古代舞蹈史教程', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '《中国古代舞蹈史教程(舞蹈卷)》介绍了:舞蹈是艺术之母，是人类文化的启蒙者。原始人类从本能情绪情感的发汇到生存欲望的表达、实现，都是领先动作来完成的。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i3/2680114444/O1CN01HjAfTe1ihOiy9rXAB_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 55.30, 0, 99, '9787806673737', '袁禾 编', '上海音乐出版社', '', 286, '2004-05-01 00:00:00');
INSERT INTO `bms_book` VALUES (180, '中外音乐鉴赏丛书――芭蕾舞剧鉴赏', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '芭蕾舞剧是一种集音乐、舞蹈与戏剧为一体的综合艺术，本书选取了世界芭蕾舞剧*著名的作品，从创作背景人物风采剧情介绍音乐舞蹈赏析版本推荐5个方面对作品进行赏析介绍，帮助读者朋友进一步了解这些作品，更好地欣赏这些作品。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i1/1952203232/O1CN01Uh4fKo1ZkIjsNIWCS_!!1952203232.jpg_580x580Q90.jpg_.webp', 34.20, 0, 99, '9787543973695', '黎孟德', '上海科学技术文献出版社', '', 411, '2019-05-01 00:00:00');
INSERT INTO `bms_book` VALUES (181, '见识城邦・娱乐至死', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 8, '《娱乐至死》是对20世纪后半叶美国文化中最重大变化的探究和哀悼：印刷术时代步入没落，而电视时代蒸蒸日上；电视改变了公众话语的内容和意义；政治、宗教、教育和任何其他公共事务领域的内容，都不可避免的被电视的表达方式重新定义。电视的一般表达方式是娱乐。一切公众话语都日渐以娱乐的方式出现，并成为一种文化精神。一切文化内容都心甘情愿地成为娱乐的附庸，而且毫无怨言，甚至无声无息，“其结果是我们成了一个娱乐至死的物种”。', 'http://image31.bookschina.com/2014/zuo/s6880184.jpg', 28.50, 0, 99, '9787563344970', '（美）波兹曼　著，章艳　译', '中信出版社', '', 188, '2011-06-01 00:00:00');
INSERT INTO `bms_book` VALUES (182, '后真相时代', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 8, '真相是个多面体，别有用心者只描绘其中的一面，因而我们必须擦亮双眼，看清真相如何被别有用心者挑选、加工和塑造。在本书中，纵横欧美商界的说故事大师麦克唐纳将分四个大类逐一剖析信息传播者处理真相的伎俩，帮助我们成为后真相时代清醒的局内人。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i4/2208377286554/O1CN01h7g5V51yHmRCifGPg_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 47.20, 0, 99, '9787513924443', '赫克托・麦克唐纳（Hector MacDonald）,译者：刘清山  后浪', '民主与建设出版社', '', 344, '2019-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (183, '舆论', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 8, '《公共舆论》是传播学领域的奠基之作，它第一次对公共舆论做了全景式的描述，自1922年问世以来，已被翻译成几十种文字，至今仍然保持着这个领域中的权威地位。其影响力经久不衰的奥秘在于，它卓有成效地梳理了舆论研究中一系列难以回避的问题，比如舆论从哪里来？它是怎样形成的？它能造成什么样的结果？谁是公众？公共舆论是什么意思？它是仅仅在公众中传播还是由公众自己形成的？它什么时候才能成为独立的力量？该书对成见、兴趣、公意的形成和民主形象等问题做了精辟而深刻的探讨，完成了新闻史上对舆论传播现象的首次全面论述，为后人的研究奠定了基础。', 'http://image12.bookschina.com/2018/20180604/s7803132.jpg', 62.60, 0, 99, '9787301277997', '[美]李普曼', '北京大学出版社', '', 348, '2018-05-01 00:00:00');
INSERT INTO `bms_book` VALUES (184, '演员自我修养', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 8, '人生如戏，全靠演技。', 'http://image12.bookschina.com/2018/20180524/s7693549.jpg', 30.50, 0, 99, '9787568006804', '斯坦尼斯拉夫斯基　著，刘杰　译', '华中科技大学出版社', '', 280, '2015-06-01 00:00:00');
INSERT INTO `bms_book` VALUES (185, '弱传播', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 8, '一本顶级公关团队内部口耳相传的奇书，一本不应该让你的竞争对手看到的好书！', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i1/1049653664/O1CN010nPdTl1cw9hpgxlXg_!!2-item_pic.png_580x580Q90.jpg_.webp', 68.00, 0, 99, '9787515022666', '邹振东，果麦文化 出品', '国家行政管理出版社', '', 396, '2018-10-01 00:00:00');
INSERT INTO `bms_book` VALUES (186, '见识城邦・童年的消逝', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 8, '电视时代，一切信息都能够在成人和儿童之间共享，成人和儿童之间的界限逐渐模糊，儿童几乎都被迫提早进入充满冲突、战争、性爱、暴力的成人世界，“童年”逐渐消逝。波兹曼同时指出，在成人和儿童共同成为电视观众的文化里，政治、商业、教育等最终蜕变成幼稚和肤浅的弱智文化，人类的文化精神逐渐枯萎。', 'http://image12.bookschina.com/2015/20150326/s6880172.jpg', 26.20, 0, 99, '9787508648279', '（美）尼尔・波兹曼　著，吴燕莛　译', '中信出版社', '', 232, '2015-05-01 00:00:00');
INSERT INTO `bms_book` VALUES (187, '理解媒介：论人的延伸', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 8, '互联网思维奠基之作，认知突围必读经典。', 'http://image12.bookschina.com/2019/20190530/1/s8064931.jpg', 69.50, 0, 99, '9785447717773', '（加拿大）马歇尔・麦克卢汉 著,何道宽 译', '译林出版社', '', 595, '2019-10-01 00:00:00');
INSERT INTO `bms_book` VALUES (188, '人民日报记者说：好稿是怎样“修炼”成的', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 8, '时间是一种充满魔力的尺度，标注时代的变迁，也丈量个人的足迹。历经时间的反复淘洗，一个记者究竟能走多远？', 'http://image12.bookschina.com/2018/20180928/2/s7855668.jpg', 33.80, 0, 99, '9787511554857', '费伟伟', '人民日报出版社', '', 363, '2018-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (189, '新媒体用户研究：节点化、媒介化、赛博格化的人', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 8, '人既是新媒体的用户，也是社会的基本单元，更是复杂的生命体。《新媒体用户研究》既体现以人为本的观察视角，更呈现出面向未来的研究意识。\n', 'http://image12.bookschina.com/2020/20200905/3/s8315091.jpg', 60.70, 0, 99, '9787300280677', '彭兰', '中国人民大学出版社', '', 400, '2020-05-15 00:00:00');
INSERT INTO `bms_book` VALUES (190, '巴黎烧了吗？', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 8, '“巴黎烧了吗？”这是1944年8月25日，巴黎解放那天，阿道夫·希特勒在东普鲁士“狼穴”的地堡里，向他的总参谋长约德尔上将发出的责问。 本书生动而又详细地描绘了1944年8月解放巴黎的战斗全过程。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i1/1049653664/TB1PYzHLXXXXXakXXXXXXXXXXXX_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 30.00, 0, 99, '9787544754606', '(美)科林斯 等  著，  董乐山  译', '译林出版社', '', 496, '2015-08-01 00:00:00');
INSERT INTO `bms_book` VALUES (191, '沉默的螺旋:舆论――我们的社会皮肤', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 8, '本书是传播学领域的经典著作，论述了舆论的形成过程和机制。作为传播学的基础理论之一，沉默的螺旋理论被相关学科广泛应用并不断发展。作者在新版本中加进了对舆论学理论最新进展的研究，更加切合实际生活。本书也是德文原版的首本中文译本', 'http://image12.bookschina.com/2014/20140312/s6335767.jpg', 42.70, 0, 99, '9787301200346', '(德)伊丽莎白・诺尔-诺依曼', '北京大学出版社', '', 317, '2013-09-01 00:00:00');
INSERT INTO `bms_book` VALUES (192, '宣传：观念、话语及其正当化', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 8, '本书是宣传概念的历史，也是宣传观念的历史。为了回答什么是宣传、它为什么会存在、大众为什么会容忍宣传等问题，本书追溯了第一次世界大战中宣传概念的产生、美国20世纪初宣传与民主的争论、俄国革命的宣传观念、第二次世界大战中的宣传观念、二十世纪后期的新宣传等宣传观念发展的重要环节，并以此为背景，重点研究了中国宣传观念的产生、国民党及共产党宣传观念的建立、知识分子与宣传、1949年之后中国宣传观念的变迁等问题。本书以理性中立的笔调，详细描述了二十世纪以来各种宣传观念和话语的交锋，展示了一幅国家与个人、控制与自由、思想与身体等观念相互冲突的全景图像。本书提出的问题值得每个深受宣传影响的中国人思考。', 'http://image12.bookschina.com/2020/20200430/1/s8266820.jpg', 73.90, 0, 99, '9787500091110', '刘海龙', '中国大百科全书出版社', '', 388, '2013-08-01 00:00:00');
INSERT INTO `bms_book` VALUES (193, '对空言说：传播的观念史', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 8, '《对空言说：传播的观念史》一书，以广泛的跨学科的人文视角，向读者展现了传播的观念史，它不仅阐述了传播观念的历史沿革，而且旁征博引，论及历史、哲学、宗教、文化乃至法学与技术史领域，将传播的视域追溯至西方思想中那些最根本的问题。即体现了传播学研究的人文取向，也以一种通俗大众的表达方式激发了公众对传播学的兴趣。', 'http://image12.bookschina.com/2017/20170418/s7399132.jpg', 53.70, 0, 99, '9787532772797', '（美）约翰?杜翰姆?彼得斯 著，邓建国 译', '上海译文出版社', '', 410, '2017-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (194, '文本盗猎者:电视粉丝与参与式文化', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 8, '本书是传播学媒介分析和文化研究经典著作，2012年劳特利奇出版社出版了本书的20周年纪念版。本书反对将粉丝看做愚昧、盲目的“文化白痴”，而是将他们看作媒体内容的积极消费者、熟练的参与者，是从借来的材料中建构自己文化的游猎式的文本盗猎者，是勇于争夺文化权力的斗士。电视粉丝热衷于对媒体文本进行各种自主性的符号阐释，并且从大众文化资源中盗取零散的片段，讲述自己的故事，阐发自己的欲望。本书的作者从粉丝和学者双重知情人身份的角度出发，以详细而生动的具体案例，分析了《星际迷航》《布雷克七人组》《异形帝国》《侠胆雄狮》《双峰》等电视剧粉丝的再创作行为和社群生态，以民族志研究方法为主考察粉丝社群，重点关注其社会机制、文化实践，并在此基础上讨论了大众媒体、资本主义消费主义和观众意识形态及能动性之间的复杂关系。', 'http://image31.bookschina.com/2017/zuo/s7395095.jpg', 56.90, 0, 99, '9787301275771', '(美)亨利・詹金斯(Henry Jenkins)', '北京大学出版社', '', 416, '2016-11-30 00:00:00');
INSERT INTO `bms_book` VALUES (195, '叙事的胜利――在大众文化时代讲故事', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 8, '在这个大众传媒让我们比祖先花更多的时间来吸收故事的时代，叙事是我们生活中基本而不可替代的需求之一。本书穿越由都市传说、杰克·尼科尔森、《艾凡赫》、纳博科夫、性丑闻与闲谈，以及《罗马帝国衰亡史》构成的奇妙图景，巧妙地将文学和电影评论结合起来。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i4/859515618/O1CN014KWkN51rN5idSsEMd_!!0-item_pic.jpg_580x580Q90.jpg', 45.00, 0, 99, '9787305230684', '[加]罗伯特・弗尔福德 著，李磊 译', '南京大学出版社', '', 217, '2020-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (196, '编辑人的世界', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 8, '《编辑人的世界》是美国五十年来最权威的编辑职业“圣经”，是出版从业者案头必备书，中文新版完整呈现原书全貌。自一九六二年问世，分别于一九八五年，一九九三年进行了两次修订，本版据一九九三年第三次完全修订版翻译。收录了美国当代最杰出的出版人撰写的三十八篇文章，从编辑行业性质、职业素养，到如何策划选题、编辑稿件、打造畅销书；从编辑大众市场类图书，到专门化类型读物……《编辑人的世界》将为你揭开编辑的神秘面纱，带你领略千变万化的出版行业。', 'http://image12.bookschina.com/2019/20190720/1/s8094987.jpg', 128.00, 0, 99, '9787513311434', '（美）杰拉尔德 ・ 格罗斯 主编 ， 新经典   出品', '北京十月文艺出版社', '', 440, '2014-03-01 00:00:00');
INSERT INTO `bms_book` VALUES (197, '社交媒体简史：从莎草纸到互联网', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 8, '社交媒体其实并不是什么新鲜的东西。从西塞罗和其他古罗马政治家用来交换信息的莎草纸信，到宗教改革、美国独立、法国大革命期间印制的宣传小册子，过去人类跟同伴交流信息的方式依然影响着现代社会。在报纸、广播和电视主导了信息的散播几十年后，互联网的出现使社交媒体重新变成人们与朋友分享信息的有力工具，并推动公共讨论走向一个新的模式。', 'http://image12.bookschina.com/2019/20190302/1/s8017439.jpg', 33.10, 0, 99, '9787508696980', '［英］汤姆?斯丹迪奇', '中信出版社', '', 320, '2019-03-01 00:00:00');
INSERT INTO `bms_book` VALUES (198, '真相：信息超载时代如何知道该相信什么', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 8, '六步质疑法分辨谣传，获得事实的真相！', 'http://image12.bookschina.com/2014/20140527/s6507907.jpg', 26.20, 0, 99, '9787300186658', '[美]比尔・科瓦奇', '中国人民大学出版社', '', 237, '2014-03-01 00:00:00');
INSERT INTO `bms_book` VALUES (199, '新闻传媒写作精要与范例实用大全', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 8, '新闻教育和新闻人才的必备参考书，媒体从业者和新闻院校学生的自学读物', 'http://image12.bookschina.com/2016/20161223/s7335743.jpg', 42.00, 0, 99, '9787515818115', '胡小英 著', '中华工商联合出版社', '', 318, '2017-01-10 00:00:00');
INSERT INTO `bms_book` VALUES (200, '传播学史――一种传记式的方法', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 8, '《传播学史:一种传记式的方法》：撰写传播学史的历史学家具有多种可供选择的方法，美国著名的传播学者E·M·罗杰斯通过传记式的编写工作，在人的基础上来理解传播学史，这是一个独特的视角，涉及众多人物与机构以及若干学科的知识背景，并以此表明，传播研究如何富有意义地影响了社会学，政治学和心理学等学科，这种有重点的综合研究使《传播学史:一种传记式的方法》成为上述领域的学者必读的读物。《传播学史:一种传记式的方法》内容丰富，史实性强，图文并茂，人物生平纪事详尽，叙述有通俗与专业相结合的特点，故会为传播学的广大专业与业余读者所喜爱。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i2/859515618/TB2a2HoHH9YBuNjy0FgXXcxcXXa_!!859515618-0-item_pic.jpg_580x580Q90.jpg', 46.90, 0, 99, '9787532737062', '[美] E.M.罗杰斯 著，殷晓蓉 译', '上海译文出版社', '', 498, '2005-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (201, '李可老中医急危重症疑难病经验专辑', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 1, '《李可老中医急危重症疑难病经验专辑》讲述了李师的可贵之处，就在于面对病人生死存亡这际，他从不考虑个人安危得失与风险，像孙思遥、邈所称道的苍生大医那样“一心赴救”，并常以数百克附子，挽救病人于无何之乡！使剧毒之品变成了救命仙丹。无怪乎广东一位老中医赞李可为中医的脊梁。', 'http://image12.bookschina.com/2013/20130313/s5699057.jpg', 22.30, 0, 99, '9787537718332', '李可', '山西科学技术出版社', '', 407, '2002-06-01 00:00:00');
INSERT INTO `bms_book` VALUES (202, '李德修三字经派小儿推拿 ', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 1, '简单易学有效的小儿推拿宝典，儿童经络使用手册，让您悉心“掌”握孩子的健康。', 'http://image12.bookschina.com/2014/20140323/s6577473.jpg', 24.10, 0, 99, '9787543693272', '李先晓,王鹏 编', '青岛出版社', '', 222, '2013-08-01 00:00:00');
INSERT INTO `bms_book` VALUES (203, '圆运动的古中医学', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 1, '该书以《易经》河图中气升降圆运动之理，破解《内经》、《难经》、《神农本草经》、《伤寒杂病论》、温病学说的千古奥秘，批判地继承、发展了古中医学，从头绪纷繁的古医经中，理出了“生命宇宙整体观” 、科学实用的中医系统科学。成为当代继承发展中医学的入门向导、成功阶梯。', 'http://image31.bookschina.com/small/66/36/2393366.jpg', 25.80, 0, 99, '9787802312074', '彭子益  著，李可  主校', '中国中医药出版社', '', 307, '2007-06-01 00:00:00');
INSERT INTO `bms_book` VALUES (206, '图解本草纲目', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 1, '《中国家藏01•图解本草纲目:中国人必备的居家生活养疗大全(超值白金版)》由明代著名医学家、博物学家李时珍所撰，是中国最具世界性影响的药学及博物学巨典。它集中国古代医学所取得的最高成就为一体，同时广泛涉及相关的生物、化学、天文、地理、地质、采矿等领域，成为中国古代科技史上部头最大、内容最丰富的巨著，曾被英国生物学家达尔文誉为“中国的百科全书”。', 'http://image12.bookschina.com/2018/20180723/2/s7191969.jpg', 26.52, 0, 99, '9787561337707', '（明）李时珍著，健康大学堂编委会  编著', '河北科技出版社', '', 443, '2010-04-01 00:00:00');
INSERT INTO `bms_book` VALUES (207, '黄帝内针', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 1, '黄帝内针（简称内针）是源自《内经》的针法，其传承绵密久远，至真海杨师，始公之于众。内针之法不离阴阳，其理则直系于中，故而其方针或上或下、或左或右，每每皆逢其原。其刺有若《灵枢·九针十二原》之易用难忘，其效则每能如拨刺、如雪污、如决闭、如解结。时下，多以疗效评品医学，黄帝内针之问世，当能为中医展现其鲜活的生命。', 'http://image12.bookschina.com/2017/20170403/s7385975.jpg', 44.90, 0, 99, '9787513236140', '杨真海传讲,刘力红整理', '中国中医药出版社', '', 166, '2016-12-01 00:00:00');
INSERT INTO `bms_book` VALUES (208, '中医基础理论习题集', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 1, '全国中医药行业高等教育“十三五”规划教材配套用书', 'http://image12.bookschina.com/2020/20201105/1/s8428209.jpg', 65.60, 0, 99, '9787801564542', '郑洪新', '中国中医药出版社', '', 290, '2004-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (209, '濒湖脉学译注', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 1, '《濒湖脉学译注》对《濒湖脉学》进行了翻译和注释。译文有浅近的现代汉语，并注意押韵，以利于朗读和背诵。《濒湖脉学译注》中难懂的古汉语词汇和医学名词术语，均做了详细的解释。《濒湖脉学译注》由明代李时珍编写。', 'http://image12.bookschina.com/2014/20140304/s5889475.jpg', 14.30, 0, 99, '9787800130953', '李时珍', '中国中医药出版社', '', 96, '1988-06-01 00:00:00');
INSERT INTO `bms_book` VALUES (210, '解剖列车――徒手与动作治疗的肌筋膜经线', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 1, '《解剖列车：徒手与动作治疗的肌筋膜经线（第三版）》清晰地描述了人在功能上的整体性，是由连续的筋膜网络构成，形成了“有迹可循”的肌筋膜“经线”。身体的稳定、张力、拉力、固定、回弹及姿势代偿都是通过这些经线来分配的。通过该经线图，本书为徒手和运动治疗师提供了全新、整体的治疗策略以恢复和改善人体姿势与运动功能。', 'https://g-search2.alicdn.com/img/bao/uploaded/i4/i1/2640032101/O1CN01VcGn4Q1ROIhyY7I5c_!!0-item_pic.jpg_580x580Q90.jpg', 199.70, 0, 99, '9787516305225', '托马斯・梅尔斯著关玲等译', '北京科学技术出版社', '', 334, '2015-04-22 00:00:00');
INSERT INTO `bms_book` VALUES (211, '医学衷中参西录', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 1, '《医学衷中参西录》是河北盐山县已故名医张锡纯(1860-1933年)所著。原书从1918年至1934年分七期陆续刊行。第一期1918年出版，第二期1919年出版，第三期1924年出版，1929年又将三期合编，分上、下两册出版，共八卷，即现行的前三期合编，前后共印行五版。第四期一册，共五卷，1924年出版，曾印行四版。第五期分上、下两册，八卷，于1928年出版。第七期一册，共四卷，1934年出版，印行二版。全书共七期，30卷。至于附录乃是张氏传人于1957年献出的遗稿。', 'http://image12.bookschina.com/2018/20180521/s7734002.jpg', 66.80, 0, 99, '9787537733106', '张锡纯', '山西科学技术出版社', '', 641, '2009-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (212, '生理学（第9版）', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 1, '', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i2/2210399790707/O1CN01mbiNa61H5qfw49Zss_!!2210399790707.png_580x580Q90.jpg', 63.80, 0, 99, '9787117266598', '王庭槐', '人民卫生出版社', '', 348, '2018-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (213, '人体解剖彩色图谱(第3版）', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 1, '本书是我国第一部自编、手工绘制彩色图谱，以实物标本写生为主，色泽艳丽、结构清晰、边界明确、形态典型，极受读者欢迎。编排包括系统解剖和局部解剖两部分，系统解剖中的某些图采用“一图多用”的表现方法进行设计，使其得以在局部解剖图中予以综合展示。第3版图谱将以“提升品牌和质量”为目标，坚持“传承与创新结合、纸质与数字结合、传统技术与新兴技术融合、传统载体与新兴载体融合”为原则，进一步优化内容，同时通过二维码关联3D和AR等数字化内容，加强数字融合，实现纸质与数字的互动互补。并将根据最新版教材进一步完善体系，在前两版的基础上增加头部、躯干断层解剖等内容，最终实现系统解剖、局部解剖和断层解剖的完美融合！', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i4/884141964/O1CN01saFoQ61QNYVPgDtod_!!884141964.jpg_580x580Q90.jpg', 66.00, 0, 99, '9787117065788', '郭光文，王序 著', '人民卫生出版社', '', 584, '2018-11-09 00:00:00');
INSERT INTO `bms_book` VALUES (214, '人体解剖学习题集', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 1, '全国中医药行业高等教育“十三五”规划教材配套用书', 'https://g-search2.alicdn.com/img/bao/uploaded/i4/i1/288902762/O1CN01Lg0FSA1WH2VSpUXNd_!!0-item_pic.jpg_580x580Q90.jpg', 37.10, 0, 99, '9787801564733', '邵水金', '中国中医药出版社', '', 202, '2003-08-04 00:00:00');
INSERT INTO `bms_book` VALUES (215, '四圣心源・清代名医黄元御系列', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 1, '《四圣心源》是清代名医黄元御的精华之作，旨在弘扬四圣（黄帝、岐伯、越人、仲景）之伟业，阐发四圣典籍之精蕴。黄氏在《四圣心源》中详加阐述“枢轴运动”（圆运动）的观点，崇尚气化，首重中气（脾胃），兼及四维（心、肺、肝、肾）。书中黄氏自拟方颇多，方旨彰显，遣药简洁，配伍精当，切合临床。全书结构严谨、条理分明、文笔精炼、风格独特，读之令人耳目一新，是一部理论和实践相结合的综合性医书。', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/i4/720904173/O1CN01QLDf5q1ghHNDRYPIz_!!0-item_pic.jpg_580x580Q90.jpg', 20.90, 0, 99, '9787802317291', '清黄元御（著），孙熙洽（校注）', '中国中医药出版社', '', 196, '2009-11-01 00:00:00');
INSERT INTO `bms_book` VALUES (216, '诊断学（第9版）', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 1, '', 'https://g-search2.alicdn.com/img/bao/uploaded/i4/i1/3386753267/O1CN01EEka9a1a0KXdR9bkz_!!0-item_pic.jpg_580x580Q90.jpg', 93.50, 0, 99, '9787117263740', '万学红、卢雪峰', '人民卫生出版社', '', 397, '2018-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (217, '五运六气天文历法基础知识', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 1, '田合禄编写的《五运六气天文历法基础知识》是一部论述天文历法和中医，辨证论治，中医理法方药的理论图书，是研究五运六气的基础知识的一部分，是中医理论基础的重要基础部分，是西医和中医在学习时必须掌握的基础知识。', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/i2/2209371910294/O1CN01QLGYpR1E2h5eQbrsv_!!2209371910294.jpg_580x580Q90.jpg', 17.80, 0, 99, '9787537754316', '田合禄、王卿编', '山西科学技术出版社', '', 285, '2016-12-01 00:00:00');
INSERT INTO `bms_book` VALUES (218, '思考中医：对自然与生命的时间解读', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 1, '伤寒，是我们讨论的这部书的核心，有关它的涵义我们应该很清楚。伤寒这个概念，在《素问・热论》里有很明确的定义：“今夫热病者，皆伤寒之类也。”这个定义说明了伤寒的一个非常显著的特征，那就是发热的特征。凡是属于发热性的疾病，或者说凡是具有发热特征的疾病都属于伤寒的范畴.《内经》对伤寒的这个定义，是从最基本的点上去定义的，但是，扩展开来却显得很泛化，不容易把握。为此，到了《难经》的时候，又给它作了一个更具体的定义。《难经・五十八难》云：“伤寒有五，有中风、有伤寒、有湿温、有热病、有温病。”《难经...\n', 'http://image12.bookschina.com/2019/20190814/1/s8148680.jpg', 28.80, 0, 99, '9787563339198', '刘力红 著', '广西师范大学出版社', '', 484, '2003-06-01 00:00:00');
INSERT INTO `bms_book` VALUES (219, '桂林古本伤寒杂病论', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 1, '《伤寒杂病论》是中医四大经典之一，为东汉末年医学家张仲景所著，流传至今版本多样，桂林古本《伤寒杂病论》即为其中之一。1939年中医学家黄竹斋先生于浙江宁波访书期间，从桂林医家罗哲初先生处得张仲景四十六世孙张绍祖家藏《伤寒杂病论》第十二稿手抄本，是书16卷，内容与通行本《伤寒杂病论》有差异，多出1／3。《桂林古本伤寒杂病论》包含了，六气主客、伤暑脉证并治、热病脉证并治、湿病脉证并治、伤燥脉证并治、伤风脉证病治、寒病脉证并治等篇，是与通行本《伤寒杂病论》不同之处，亦为本书特色。\n', 'http://image12.bookschina.com/2019/20190811/1/s8063611.jpg', 37.10, 0, 99, '9787513218504', '张仲景', '中国中医药出版社', '', 186, '2014-06-01 00:00:00');
INSERT INTO `bms_book` VALUES (220, '外科学（第9版）', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 1, '', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/i4/416222484/O1CN011UDiHzuoA54jEig_!!416222484-0-item_pic.jpg_580x580Q90.jpg_.webp', 98.60, 0, 99, '9787117266390', '陈孝平、汪建平、赵继宗', '人民卫生出版社', '', 808, '2018-08-01 00:00:00');
INSERT INTO `bms_book` VALUES (221, '约翰・汤普森简易钢琴教程2', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '供教师和家长用的伴奏，不仅可以使这些曲例听起来更加完整，而且对建立良好的节奏感和速度感，甚至对促使学生有表情地弹奏都有极大的帮助。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i1/2208543647976/O1CN01GmxTeL28n3d97bXA3_!!2208543647976.jpg_580x580Q90.jpg_.webp', 10.80, 0, 99, '9787806677704', '（美）汤普森　著，周永达　译', '上海音乐出版社', '', 47, '2005-10-01 00:00:00');
INSERT INTO `bms_book` VALUES (222, '拜厄钢琴基本教程', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '《拜厄钢琴基本教程》主要包括：音乐入门知识；单手与双手的触键练习；从全音符到八分音符的四手联弹；识别低音谱表中的音符等。《拜厄钢琴基本教程》有109条练习和34条附录练习，其间穿插了《布谷鸟》、《啊！苏姗姗》等22首小乐曲，使学琴者在这琴之初就体味到弹奏乐曲的乐趣。在济重趣味性的同时，注意知识与练习衔接、与时代同步，力求做到内容严谨。为符合我国读者的阅读习惯，该版重新编写了说明文字。', 'http://image12.bookschina.com/2012/20120712/s5570561.jpg', 18.90, 0, 99, '9787103021842', '人民音乐出版社编辑部', '人民音乐出版社', '', 85, '2000-08-01 00:00:00');
INSERT INTO `bms_book` VALUES (224, '约翰・汤普森简易钢琴教程3', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '《约翰·汤普森简易钢琴教程3》一开始就说明：要以乐句为单位，而不是以一个一个的有为单位去思考和感受音乐，这是十分重要的。教师应当唤起学生的注意：用不同的音乐处理弹奏每一个乐句（可根据个人对乐曲的理解去演奏），是钢琴演奏的基本手段之一。触键：毫无疑问，触键是钢琴演奏中一个极为重要的环节。音阶与和弦在学习了半音和全音之后，接着是音阶的构成，和以音阶为旋律及伴奏音型的曲例。然后，用纵向结合和分解形式的和弦构成的小曲，向学生展示三和弦及转位。七和弦（及其转位）不是从和声学的角度进行分析，而是简单地作为一种和弦形式教给学生，应当让他们记住这种和弦，因为它在现阶段的乐谱中会经常出现。', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/i1/1664456249/O1CN01c84AS41w25ZIYGXz9_!!1664456249.jpg_580x580Q90.jpg', 10.80, 0, 99, '9787805536002', '（美）汤普森　著，周永达　译', '上海音乐出版社', '', 45, '2005-06-01 00:00:00');
INSERT INTO `bms_book` VALUES (225, '哈农钢琴练指法（大音符版）', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '在《哈农钢琴练指法》里，有手指灵活、独立、力度和最大限度均衡以及手腕柔韧性的练习，所有这些都是要达到优美演奏不可或缺的因素。另外，这些练习已考虑到使左手能与右手同样灵巧。除极个别的练习曲是引自其他教材外，所有练习曲都是自编的。这些练习曲富有趣味性，不像大多数五指练习那样令学生厌烦，那些枯燥的练习简直非要具备艺术大师的耐性才敢去弹奏。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i1/1716723396/O1CN011nYDpE1axPW8LprLQ_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 47.10, 0, 99, '9787103021767', '人民音乐出版社编辑部 编', '人民音乐出版社', '', 155, '2000-10-01 00:00:00');
INSERT INTO `bms_book` VALUES (226, '钢琴基础教程1 修订版', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '《高等师范院校试用教材:钢琴基础教程1(修订版)》主要收录了练习曲、幽默曲、练习曲、前进！前进！前进！、格桑拉、练习曲、卡尔图里舞曲、基本练习、基本练习、练习曲、练习曲、天真烂漫、太阳出来、练习曲、练习曲、齐步行进、练习曲、玛祖卡舞曲等内容。', 'https://g-search2.alicdn.com/img/bao/uploaded/i4/i4/1049653664/O1CN01INhRee1cw9lW135yE_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 26.90, 0, 99, '9787806672693', '韩林申，李晓平，徐斐，周荷君', '上海音乐出版社', '', 115, '2003-05-01 00:00:00');
INSERT INTO `bms_book` VALUES (227, '约翰・汤普森现代钢琴教程1', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '《约翰·汤普森:现代钢琴教程1》为一年级小学生设计。作为一年级的教材，自始至终按五指手位来写，只在最后部分有一些手指扩展的例子。如果在初级教材中学过预备性的钢琴曲，那么任何适龄儿童都可使用这本教材。 《约翰·汤普森:现代钢琴教程1(附DVD2张)》的目的在于为钢琴学习打下一个正确、完整的基础，使学生在对音乐理解的基础上感受、思考和弹奏。 《约翰·汤普森:现代钢琴教程1》中作者着重强调了旋律型、节奏型、和声型和指型。会识别音型的初学者都具有较好的视谱能力、背谱能力、演奏能力，而且掌握了指型的知识就能比一个个音符去找的孩子演奏的更好。《约翰·汤普森:现代钢琴教程1》所有的普例都保持在五指手位上，用指型来移位是很容易的；而且在学习复杂的指法前，要给学生时机，让他通过自己的实践建立五指组的指法感觉。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i2/2206965991716/O1CN01TZRei21OXyFx6JMRU_!!2206965991716.jpg_580x580Q90.jpg_.webp', 18.50, 0, 99, '9787807513384', '（美）汤普森　著', '上海音乐出版社', '', 79, '2009-03-01 00:00:00');
INSERT INTO `bms_book` VALUES (228, '车尔尼钢琴流畅练琴曲 ', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '《车尔尼钢琴流畅练习曲(作品849)》内容简介：车尔尼是贝多芬最得意的学生，又是李斯特的老师。由于他所处的时代，使得他的作品既继承了古典主义的传统，又和浪漫主义有密切的联系。车尔尼的有些练习曲，甚至可以说是为学习浪漫派作品做准备的练习曲。因此，学习车尔尼练习曲，不论对演奏古典主义的还是浪漫主义时期的钢琴作品，都有极大的帮助。', 'https://g-search2.alicdn.com/img/bao/uploaded/i4/i4/2933587576/O1CN015xnbZP25prCMcNCVH_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 15.80, 0, 99, '9787103027325', '卡尔・车尔尼 著，韦丹文，黄若愚 编', '上海教育出版社', '', 56, '2003-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (229, '小奏鸣曲集', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '小奏鸣曲是对奏鸣曲而言，因为它相对短小、单纯，故称为小奏鸣曲。它由一至三个乐章构成，各乐章之间有对比的主题和对比的速度要求。弹奏小奏鸣曲会提高演奏耐力，丰富音乐表现力，扩充演奏技术范围。是进入奏鸣曲学习阶段必不可少的练习。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i1/101450072/O1CN01VNUyxq1CP165qQQVt_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 27.50, 0, 99, '9787103026847', '人民音乐出版社编辑部', '人民音乐出版社', '', 133, '2003-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (230, '巴赫小前奏曲与赋格曲', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '《巴赫小前奏曲与赋格曲》是通过深入研究巴赫的音乐风格，在比较众多权威版本并综合一些专家意见的基础上编定而成。在曲集中适当地编加了一些速度、表情记号以及对装饰音演奏的说明，旨在尽可能忠实于原稿的基础上，便于初学者能更好地理解与把握巴赫的音乐风格，同时也为教学提供一些参考。', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/i1/101450072/O1CN01SN4IXG1CP18dtapRz_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 14.00, 0, 99, '9787103026014', '（德）巴赫', '人民音乐出版社', '', 53, '2003-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (231, '车尔尼钢琴初级练习曲 ', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '《车尔尼钢琴初级练习曲(作品599)》由上海教育出版社出版。《车尔尼钢琴初级练习曲(作品599)》是著名钢琴教育家车尔尼钢琴练习曲，是钢琴学生学习弹奏钢琴的优秀教材。每首曲子编写了准确而实用调性与曲式分析，乐曲情绪提示等。', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/i2/1049653664/O1CN01ybvTe71cw9k54M2GU_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 19.70, 0, 99, '9787544419345', '卡尔・车尔尼 著，韦丹文，鹿尧 编', '上海教育出版社', '', 86, '2008-08-01 00:00:00');
INSERT INTO `bms_book` VALUES (232, '可爱的钢琴古典名曲', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '《可爱的钢琴古典名曲: 配套曲集(原版引进)》是《巴斯蒂安钢琴教程》的配套曲集，注重与该教程的密切联系，每一集前均附有简短的使用说明，供学生练习和欣赏使用。《可爱的钢琴古典名曲: 配套曲集(原版引进)》选编的作品优美生动，除了世界钢琴古典名曲以外，还包括交响曲、歌剧和合唱的钢琴改编曲，以拓展师生的教学领域。《可爱的钢琴古典名曲: 配套曲集(原版引进)》的所有70首乐曲都经过改编，在保持原作精髓的基础上，降低了演奏的技术难度，让初学者也能快乐地演奏世界名曲。', 'https://g-search2.alicdn.com/img/bao/uploaded/i4/i2/2207466252/O1CN016DTogI1w3Sr7sgzww_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 51.30, 0, 99, '9787806677827', '詹姆斯・巴斯蒂安', '上海音乐出版社', '', 110, '2006-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (233, '聆听音乐（第七版）', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '本书是一部不可多得的音乐欣赏指南，帮助读者理解任何时代及文化中的音乐，发展和提炼聆听技巧。阅读后你将会发现自己、快乐、自信的聆听和感受音乐。', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/i1/174215483/O1CN01cLoCAr1qNG85q3jm5_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 76.80, 0, 99, '9787302497400', '[美]克雷格・莱特(Craig Wright) 著     余志刚   译', '清华大学出版社', '', 544, '2018-09-01 00:00:00');
INSERT INTO `bms_book` VALUES (234, '约翰・汤普森现代钢琴教程(2) ', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '《约翰·汤普森现代钢琴教程2》的宗旨在于使教师和学生都能愉快地从事教学，并更快地获得最佳的学习效果。《现代钢琴教程》紧接第一册继续“循序渐进”。考虑到现代初学者的需要，第二册的内容不限于钢琴音乐。为使年轻的学生同时从欣赏和钢琴中获得乐趣，这里选了一些轻歌剧、芭蕾、大歌剧、清唱剧和歌曲的曲例，加了注释。这样就坚持了这套教材的口号“每课都有新的内容”。', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/i1/1049653664/TB1D2C8KVXXXXXTXVXXXXXXXXXX_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 18.00, 0, 99, '9787805536125', '（美国）约翰・汤普森（John Thompson）', '上海音乐出版社', '', 90, '1995-12-01 00:00:00');
INSERT INTO `bms_book` VALUES (235, '约翰・汤普森简易钢琴教程4 ', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '《约翰·汤普森简易钢琴教程4(原版引进)》教材共有8本，主要针对年龄较小的儿童学习钢琴的特点，放慢进度，使用了大量的插图，包括双手联弹、填写音符、视奏等。收录了美国的儿童歌曲、民歌，古典作曲家的钢琴曲、歌剧、交响乐等改编曲，简化版等。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i1/1049653664/TB1iIqQKVXXXXamXVXXXXXXXXXX_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 14.20, 0, 99, '9787805536033', '汤普森 (作者), 周永达（译者）', '上海音乐出版社', '', 46, '2005-06-01 00:00:00');
INSERT INTO `bms_book` VALUES (236, '巴斯蒂安钢琴教程 1（共4册）', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '《巴斯蒂安钢琴教程1》(套装共4册)(原版引进)是《巴斯蒂安钢琴教程》中的一册，本套教程是特别为初学钢琴的学生，能够正确学习钢琴演奏基础而设计的一套有趣的、内容全面的钢琴教材。精心安排的学习顺序能够平衡学生各方面的学习进度；精心设计的全彩插图能够增强学生的学习兴趣，提高他们的学习效果。教程中所采用的乐曲，除了原作外，还有大家熟悉和喜欢的各国民歌、流行歌曲和改编曲等。', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/i2/187331211/O1CN01oRv4Ln1Kog9C02UxO_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 101.10, 0, 99, '9787806677773', '{美}詹姆斯・巴斯蒂安', '上海音乐出版社', '', 168, '2006-04-01 00:00:00');
INSERT INTO `bms_book` VALUES (237, '认识乐理（第8版）', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '不管学习哪种乐器，乐理知识必不可少！无需音乐基础，从零开始，轻松走进音乐世界！', 'https://g-search2.alicdn.com/img/bao/uploaded/i4/i2/859515618/O1CN01VRHgw61rN5ayXTNHk_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 64.50, 0, 99, '9787550277779', '［美］布鲁斯・本沃德 ［美］芭芭拉・加维・杰克逊  ［美］布鲁斯・R・杰克逊，译者：蒋�r    后浪', '北京联合出版公司', '', 312, '2016-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (238, '布格缪勒钢琴进阶练习25首 ', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '《布格缪勒钢琴进阶练习25首(作品100)》内容简介：布格缪勒(Johann Friedrich Farnz Burgmuller)，1806年12月4日生于德国巴伐利亚省的勒根斯堡，1874年2月10日卒于法国塞纳-瓦兹区的波尔那村。德国作曲家、钢琴家。其父J.A.F.布格缪勒和其弟N.布格缪勒都是作曲家和钢琴教师。他擅长为青少年学琴者创作钢琴小曲和练习曲。《布格缪勒钢琴进阶练习25首(作品100)》是他的作品第100号，有25首练习曲，都是兼具技术性和趣味性的小曲。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i1/3022849991/TB28z0iGQ9WBuNjSspeXXaz5VXa_!!3022849991-0-item_pic.jpg_580x580Q90.jpg_.webp', 14.20, 0, 99, '9787103029350', '人民音乐出版社编辑部', '人民音乐出版社', '', 35, '2004-11-01 00:00:00');
INSERT INTO `bms_book` VALUES (239, '钢琴弹唱儿童歌曲100首', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '', 'https://g-search2.alicdn.com/img/bao/uploaded/i4/i1/322791652/O1CN01Ytj5Zh1O4ewEYXilJ_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 26.00, 0, 99, '9787122334954', '臧翔翔  编著', '化学工业出版社', '', 112, '2009-06-06 00:00:00');
INSERT INTO `bms_book` VALUES (240, '最易上手吉他弹唱超精选（讲义版）', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 13, '本书是《最易上手！吉他弹唱超精选》2017年*升级版本。书中的曲谱部分与原书完全一致，并会同步更新。为方便老师教学及自学者，书中在曲谱之后添加了入门教程讲义，包含与本书曲谱程度一致的吉他弹奏、乐理知识，使得全书成为了一个完整的教学资料。只有曲谱部分的原书也会继续发行，如不需要教学讲义，可直接购买定价为32元的原书。本书仅适合学琴2~12个月的初学者或同等水平的“资深初学者”。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i4/1065721768/O1CN01AcCV1v1Ovmr7cL912_!!2-item_pic.png_580x580Q90.jpg_.webp', 29.90, 0, 99, '9787540467715', '卓飞', '湖南文艺出版社', '', 344, '2017-06-01 00:00:00');
INSERT INTO `bms_book` VALUES (241, '次第花开 修订版', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 3, '《次第花开》是希阿荣博堪布所写的心灵随笔集，以现代人的思维和表达方式，将心灵世界应有的美好境界娓娓道来。', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/i4/2201200455984/O1CN01QPtSRG1u4ieAeuaLo_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 34.70, 0, 99, '9787544334792', '希阿荣博堪布', '海南出版社', '', 312, '2017-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (242, '半小时漫画中国哲学史', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 3, '明明在看诸子百家掐架，看完却懂了中国哲学精华！', 'http://image12.bookschina.com/2020/20201006/1/s8404386.jpg', 48.90, 0, 99, '9787559449863', '陈磊.半小时漫画团队 著;读客文化 出品', '江苏凤凰文艺出版社', '', 304, '2020-08-01 00:00:00');
INSERT INTO `bms_book` VALUES (243, '人生的智慧：如何幸福度过一生', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 3, '叔本华代表作，被誉为幸福指南的哲学入门课，让你活出新自我', 'http://image12.bookschina.com/2019/20190604/5/s8038468.jpg', 33.60, 0, 99, '9787208055162', '[德] 阿图尔・叔本华 著，作家榜经典 出品，木云、林求是 译，大星文化', '中信出版社', '', 275, '2015-11-01 00:00:00');
INSERT INTO `bms_book` VALUES (244, '人间生死书', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 3, ' 如何活好这一生的“答案之书”', 'http://image12.bookschina.com/2020/20201108/1/s8412135.jpg', 44.20, 0, 99, '9787556124039', '著者：伊拉莎白・库伯勒・罗斯，大卫・凯思乐 译者：徐黄兆', '湖南人民出版社', '', 312, '2020-09-01 00:00:00');
INSERT INTO `bms_book` VALUES (245, '沉思录', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 3, '《沉思录》是古罗马皇帝奥勒留写给自己的书，内容大部分是他在鞍马劳顿中写成的。作品来自奥勒留对身羁宫廷的自己和自己所处混乱世界的感受，追求一种冷静而达观的生活。这部著作是斯多葛学派的一个里程碑。', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i1/2041592426/O1CN01dKY2t81Tn9SexDG24_!!2041592426-0-lubanu-s.jpg_580x580Q90.jpg_.webp', 16.60, 0, 99, '9787802115743', '马可.奥勒留 青豆书坊 出品', '中央编译出版社', '', 211, '2008-02-01 00:00:00');
INSERT INTO `bms_book` VALUES (246, '理想国', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 3, '《理想国》涉及柏拉图思想体系的各个方面，包括哲学、伦理、教育、文艺、政治等内容，主要是探讨理想国家的问题。', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/imgextra/i3/54222896/O1CN01vUKkkR1XGPeKbkHbe_!!0-saturn_solar.jpg_580x580Q90.jpg_.webp', 31.20, 0, 99, '9787100017565', '柏拉图', '中国华侨出版社', '', 448, '1986-06-01 00:00:00');
INSERT INTO `bms_book` VALUES (247, '洞见', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 3, '一切为“空”，还是我们赋予一切的“内涵”为“空”？', 'http://image12.bookschina.com/2020/20200827/1/s8376677.jpg', 65.70, 0, 99, '9787559636164', '罗伯特・赖特 著，宋伟 译，联合读创 出品', '北京联合出版有限公司', '', 320, '2020-08-01 00:00:00');
INSERT INTO `bms_book` VALUES (248, '道德经', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 3, '老子传世之作 中国“万经之王” 读通此书可修身齐家可治国平天下', 'http://image12.bookschina.com/2020/20200804/1/s8157083.jpg', 29.20, 0, 99, '9787212003760', '（春秋）老子著；富强译 注，高高国际  出品', '作家出版社', '', 224, '1990-05-01 00:00:00');
INSERT INTO `bms_book` VALUES (249, '学会提问（原书第11版）', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 3, '一本授人以渔的智慧之书，独立思考者的起点。已更新至第11版专家说得再动听，也不能帮我们救急。拥有批判性思维才是应对混沌世界的正确姿势！中国学校里学不到的批判性思维方法，打开心智提早具备未来创新型人才的核心竞争力！华为、小米、腾讯等创新型企业最看重的能力——批判性思维！史上最有内涵的思维训练书！美国超过300所高校采用！', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/i1/2201514655578/O1CN01pL135P1r4lpH2V9hZ_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 35.40, 0, 99, '9787111616832', '[美] 尼尔?布朗 (Neil Browne) ，斯图尔特?基利 (Stuart Keeley) 著', '机械工业出版社', '', 292, '2019-04-01 00:00:00');
INSERT INTO `bms_book` VALUES (250, '2021王阳明心学日历', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 3, '每日一句心学名言，每月一则心学故事，日积月累通晓知行合一智慧！知行合一王阳明作者度阴山讲解！', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i2/2447475079/O1CN01rOMTgn1nOEExSRBzz_!!2447475079.jpg_580x580Q90.jpg_.webp', 97.90, 0, 99, '9787559449597', '度阴山 著；读客文化 出品', '江苏凤凰文艺出版社', '', 135, '2020-07-15 00:00:00');
INSERT INTO `bms_book` VALUES (251, '资本论（全三册）', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 3, '卡尔·马克思(Karl Marx，1818-1883)生于德国特利尔城，是德国最著名的哲学家、经济学家，马克思主义的创始人，以及《资本论》和《共产党宣言》的作者。在1857年至1858年的近一年的时间内，马克思创作了《政治经济学批判大纲》(即《资本论》的第一稿)，第一次提出了剩余价值理论这一人类历史上的伟大发现。1867年9月14日，《资本论》第一卷在汉堡问世，在西方引发了一场强烈的轰动。《资本论》的第二卷和第三卷由于马克思的过早逝世而未能最终完成，后经恩格斯整理和增补，分别在1885年和1894年出版。《资本论》具有划时代的意义，标志着马克思主义政治经济学科学体系的创立。', 'https://g-search2.alicdn.com/img/bao/uploaded/i4/i3/2121932745/O1CN0128Fyar1W9FpVu10Yx_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 130.60, 0, 99, '9787542629791', '马克思', '上海三联书店', '', 1701, '2009-04-01 00:00:00');
INSERT INTO `bms_book` VALUES (252, '哲学家们都干了些什么', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 3, '一部既严谨又不严肃的哲学史', 'https://g-search3.alicdn.com/img/bao/uploaded/i4/i4/2456285297/O1CN01pWJqrC1p04UqhPyR3_!!0-item_pic.jpg_580x580Q90.jpg_.webp', 51.00, 0, 99, '9787550242234', '林欣浩 著；读客文化 出品', '北京联合出版公司', '', 528, '2015-04-01 00:00:00');
INSERT INTO `bms_book` VALUES (253, '美的历程', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 3, '本书是中国美学的经典之作。凝聚了作者李泽厚先生多年研究，他把中国人古往今来对美的感觉玲珑剔透地展现在大家眼前，如斯感性，如斯亲切。今配以精美的插图，本书就更具体地显现出中国这段波澜壮阔的美的历程。', 'http://image31.bookschina.com/2019/zuo/11/s6511678.jpg', 40.30, 0, 99, '9787108030375', '李泽厚', '生活.读书.新知三联书店', '', 273, '2009-01-04 00:00:00');
INSERT INTO `bms_book` VALUES (254, '人生有何意义', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 3, '《人生有何意义》内容简介：“人生有何意义？”其实这个问题是容易解答的。人生的意义全是各人自己寻出来，造出来的：高尚，卑劣，清贵，污浊，有用，无用，……全靠自己的作为。生命本身不过是一件生物学的事实，有什么意义可说？生一个人与一只猫，一只狗，有什么分别？人生的意义不在于何以有生，而在于自己怎么生活。你若情愿把这六尺之躯葬送在白昼作梦之上，那就是你这一生的意义。你若发愤振作起来，决心去寻求生命的意义，去创造自己的生命的意义，那么，你活一日便有一日的意义，作一事便添一事的意义，生命无穷，生命的意义也无穷了。', 'http://image12.bookschina.com/2016/20161003/s7280432.jpg', 24.90, 0, 99, '9787510816482', '胡适　著', '民主与建设出版社', '', 283, '2013-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (255, '论语译注', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 3, '《论语译注》内容包括：试论孔子、导言、例言、学而篇第一、为政篇第二、八佾篇第三、里仁篇第四、公冶长篇第五、雍也篇第六、述而篇第七、泰伯篇第八、子罕篇第九、乡党篇第十、先进篇第十一、颜渊篇第十二等。', 'http://image12.bookschina.com/2013/20131120/s5838500.jpg', 16.90, 0, 99, '9787101070248', '杨伯峻 译注', '中华书局', '', 308, '2009-10-01 00:00:00');
INSERT INTO `bms_book` VALUES (256, '人生的智慧', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 3, '幸福度过一生的智慧箴言', 'http://image12.bookschina.com/2020/20200828/3/s8371846.jpg', 26.60, 0, 99, '9787208081178', '（德）阿图尔・叔本华著，李润萍 吴峰峰 译', '湖南人民出版社', '', 272, '2008-10-01 00:00:00');
INSERT INTO `bms_book` VALUES (257, '易经杂说', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 3, '书的前部分主要介绍了《易经》的一般知识，以及与之相关的一些问题。后部分着重解释了六十四卦（始“乾卦”，终“未济卦”），而以对“乾卦”的解说为最详。', 'http://image12.bookschina.com/2015/20150412/s6973297.jpg', 45.50, 0, 99, '9787309032376', '南怀瑾', '东方出版社', '', 338, '2002-06-01 00:00:00');
INSERT INTO `bms_book` VALUES (258, '中国哲学简史', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 3, '作者冯友兰于1947年在美国宾夕法尼亚大学受聘担任讲座教授，讲授中国哲学史。其英文讲稿后经整理写成《中国哲学简史》，于1948年由美国麦克米兰公司出版。此书一出，立即成为西方人了解和学习中国哲学的首选入门书。其后又有法文、意大利文、西班牙文、南斯拉夫文、日文等译本出版。多年来，这部专著一直是世界各大学中国哲学的通用教材，在西方影响很大。', 'http://image12.bookschina.com/2018/20180712/2/s7558654.jpg', 36.10, 0, 99, '9787801872166', '冯友兰 著，涂又光 译', '北京大学出版社', '', 302, '2004-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (259, '佛陀传', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 3, '全世界影响力最大的佛陀传记', 'http://image12.bookschina.com/2014/20140528/s6503096.jpg', 47.00, 0, 99, '9787807659136', '一行禅师 著；读客文化 出品', '河南文艺出版社', '', 408, '2014-03-01 00:00:00');
INSERT INTO `bms_book` VALUES (260, '塔木德', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 3, '《塔木德》（Talmud）一书是犹太人继《圣经》之后最重要的一部典籍，又称犹太智慧羊皮卷，或犹太5000年文明的智慧基因库，是揭开犹太人超凡智慧之谜的一把金钥匙。', 'https://g-search1.alicdn.com/img/bao/uploaded/i4/imgextra/i1/31044722/O1CN01p3dUtz1kkirrJyAr3_!!0-saturn_solar.jpg_580x580Q90.jpg_.webp', 28.80, 0, 99, '9787536691926', '塞妮亚', '上海三联书店', '', 268, '2008-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (261, ' 贫穷的本质', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 4, '我们为什么摆脱不了贫穷', 'http://image12.bookschina.com/2018/20181001/2/s7889747.jpg', 35.90, 0, 99, '9787508638492', '（印度）阿比吉特.班纳吉(Abhijit V.Banerjee)、（法）埃斯特.迪弗洛(Esther Duflo)', '中信出版社', '', 256, '2013-04-01 00:00:00');
INSERT INTO `bms_book` VALUES (262, '区块链革命：比特币底层技术如何改变货币、商业和世界', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 4, '本书是“数字经济之父”继畅销书《维基经济学》之后又一力作，受到多国政治界、学术界和工商界翘楚人物的推崇。本书全景式描绘互联网前沿技术─区块链技术，将如何彻底改变互联网及银行业、证券业、保险业、会计税收、法律服务业、文化创意业、物流业、医药卫生业、电力业、和制造业等行业；前瞻性阐述这种技术可以做什么，以及我们如何利用好它。', 'http://image12.bookschina.com/2016/20161001/s7289961.jpg', 51.70, 0, 99, '9787508666853', '[加]唐塔普斯科特，[加]亚力克斯・塔普斯科特', '中信出版社', '', 376, '2016-09-01 00:00:00');
INSERT INTO `bms_book` VALUES (263, '让数字说话：审计，就这么简单', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 4, '审计真的是那样枯燥无味吗？作者以浅显易懂的语言、幽默诙谐的比喻和旁征博引的故事引领我们开启一段奇妙的阅读旅程。从审计的本源到审计结果，从审计的思考方法到工作底稿、风险控制，甚至会计科目，作者都有自己透彻的理解和独到的看法。', 'http://image12.bookschina.com/2016/20160603/s7131210.jpg', 34.30, 0, 99, '9787111530817', '孙含晖（笔名：金十七）  王苏颖  阎歌', '机械工业出版社', '', 302, '2016-03-04 00:00:00');
INSERT INTO `bms_book` VALUES (264, '薛兆丰经济学讲义', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 4, '相信读完本书之后，你会对自己身处的世界有更深刻的理解，成为这个复杂世界的明白人。', 'http://image12.bookschina.com/2018/20180308/s7843447.jpg', 41.80, 0, 99, '9787508689586', '薛兆丰', '中信出版社', '', 532, '2018-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (265, '分析与思考', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 4, '黄奇帆的复旦经济课', 'http://image12.bookschina.com/2020/20200830/1/s8366010.jpg', 77.40, 0, 99, '9787208164321', '黄奇帆', '上海人民出版社', '', 162, '2020-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (266, '半小时漫画经济学3：金融危机', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 4, '用特别有趣的方式，讲清楚特别艰深的经济学原理。', 'http://image12.bookschina.com/2020/20200430/1/s8264403.jpg', 36.70, 0, 99, '9787544391931', '陈磊・半小时漫画团队 著；读客文化 出品', '海南出版社', '', 240, '2020-03-24 00:00:00');
INSERT INTO `bms_book` VALUES (267, '国富论', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 4, '亚当·斯密并不是经济学说的最早开拓者，他最著名的思想中有许多也并非新颖独特，但是他首次提出了全面系统的经济学说，为该领域的发展打下了良好的基础。因此完全可以说《国富论》是现代政治经济学研究的起点。', 'http://image12.bookschina.com/2019/20190304/1/s8007646.jpg', 44.40, 0, 99, '9787508036083', '（英）斯密　著，富强　译', '北京联合出版公司', '', 726, '2005-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (268, '国内大循环', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 4, ' 中国经济发展趋势解读！更加贴近决策层的视角彻底讲透新发展格局下的战略与机遇，厘清所涵盖的“硬核知识点”！', 'http://image12.bookschina.com/2021/20210114/1/s8420136.jpg', 51.60, 0, 99, '9787556125395', '何毅亭  黄奇帆  姚洋  著', '湖南人民出版社', '', 320, '2020-09-01 00:00:00');
INSERT INTO `bms_book` VALUES (269, '反脆弱', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 4, '尼采有句名言：“杀不死我的，使我更强大。”就像人的骨头承受压力和紧张会变得更加强壮，谣言或暴乱在有人试图压制它们时会变本加厉一样，生命中的许多事物也会受益于压力、混乱、波动和不确定。', 'http://image12.bookschina.com/2020/20200701/1/s8339583.jpg', 59.20, 0, 99, '9787508643335', '【美】纳西姆・尼古拉斯・塔勒布', '中信出版社', '', 408, '2014-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (270, '博弈论', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 4, '《博弈论》是博弈领域的两位领军人物的集大成之作，囊括了迄今为止除演化博弈之外的所有博弈论的理论和方法、代表了博弈论发展的最高水平。它不仅涵盖了博弈论的方方面面。而且几乎对每一个论题都给出了严密的数学推导和证明。《博弈论》具有以下几个特点：第一，覆盖面广，几乎涵盖了博弈论的各个领域。第二，有丰富的实例、精心构思的习题以及广泛的可扩展性。第三，深入浅出，既可以满足一般读者对博弈论的了解，也可以满足爱好技术性证明的读者对于博弈论精髓的把握。《博弈论》是经济学研究生和高年级本科生学习博弈论的最好教材，也是其他对博弈论有兴趣的读者的必备参考书。', 'http://image12.bookschina.com/2020/20200901/2/s8359589.jpg', 38.70, 0, 99, '9787300117850', '（美）约翰・冯・诺依曼', '沈阳出版社', '', 476, '2010-10-01 00:00:00');
INSERT INTO `bms_book` VALUES (271, '八次危机', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 4, '中国的真实经验1949-2009', 'http://image12.bookschina.com/2013/20130312/s5711258.jpg', 52.70, 0, 99, '9787506055574', '温铁军等著', '东方出版社', '', 300, '2013-01-01 00:00:00');
INSERT INTO `bms_book` VALUES (272, '红色资本', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 4, '揭示中国非凡崛起与金融改革的真相！', 'https://g-search2.alicdn.com/img/bao/uploaded/i4/i2/2206734298406/O1CN01yYKQf42Bxzu9Jribp_!!2206734298406.jpg_580x580Q90.jpg_.webp', 38.90, 0, 99, '9787547306079', '[美]卡尔·沃尔特(Carl E. Walter) / [美]弗雷泽·豪伊(Fraser J. Howie)', '东方出版中心', '', 270, '2013-08-01 00:00:00');
INSERT INTO `bms_book` VALUES (273, '美国陷阱', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 4, '2013年4月14日，美国纽约肯尼迪国际机场，法国阿尔斯通集团锅炉部全球负责人弗雷德里克•皮耶鲁齐，刚下飞机就被美国联邦调查局探员逮捕。 这场抓捕不仅仅是针对他个人的行为，而是美国政府针对法国阿尔斯通的系列行动之一。之后，美国司法部指控皮耶鲁齐涉嫌商业贿赂，并对阿尔斯通处以7.72亿美元罚款。阿尔斯通的电力业务，最终被行业内的主要竞争对手——美国通用电气公司收购。阿尔斯通这家曾经横跨全球电力能源与轨道交通行业的商业巨头，因此被美国人“肢解”。而皮耶鲁齐直到2018年9月才走出监狱，恢复自由。 在《美国陷阱》一书中，皮耶鲁齐以身陷囹圄的亲身经历披露了阿尔斯通被美国企业“强制”收购，以及美国利用《反海外腐败法》打击美国企业竞争对手的内幕。 这是一场隐秘的经济战争。', 'http://image12.bookschina.com/2019/20190602/1/s8070406.jpg', 51.00, 0, 99, '9787521702415', '(法)弗雷德里克・皮耶鲁齐(Frédéric Pierucci)，(法)马修・阿伦(Matthieu Aron)', '中信出版社', '', 362, '2019-05-01 00:00:00');
INSERT INTO `bms_book` VALUES (274, '怪诞行为学', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 4, '可预测的非理性', 'http://image12.bookschina.com/2018/20181121/1/s7937295.jpg', 36.00, 0, 99, '9787508622187', '【美】丹・艾瑞里（Dan Ariely）', '中信出版社', '', 248, '2010-09-01 00:00:00');
INSERT INTO `bms_book` VALUES (275, '半小时漫画经济学：生活常识篇', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 4, '用特别有趣的方式，讲清楚特别艰深的经济学原理。', 'http://image12.bookschina.com/2019/20190917/2/s8170136.jpg', 45.90, 0, 99, '9787544387873', '陈磊・半小时漫画团队 著；读客文化 出品', '海南出版社', '', 166, '2019-08-01 00:00:00');
INSERT INTO `bms_book` VALUES (276, '去依附', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 4, '中国化解第一次经济危机的真实经验', 'http://image12.bookschina.com/2019/20190930/2/s8178018.jpg', 53.70, 0, 99, '9787520710732', '温铁军 董筱丹', '东方出版社', '', 284, '2019-09-01 00:00:00');
INSERT INTO `bms_book` VALUES (277, '百岁人生：长寿时代的生活和工作', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 4, '我们都将活到100岁，长寿时代，我们的生活和工作要怎么办！', 'http://image12.bookschina.com/2018/20180821/s7849499.jpg', 51.00, 0, 99, '9787508685076', '[英] 琳达・格拉顿（Lynda Gratton）、[英] 安德鲁・斯科特（Andrew Scott）', '中信出版社', '', 360, '2018-07-10 00:00:00');
INSERT INTO `bms_book` VALUES (278, '资本论', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 4, '《经典通读:资本论》是马克思倾注毕生精力完成的科学巨著，是他一生恪守崇高信念，从事科学研究的结晶', 'http://image12.bookschina.com/2018/20180402/s7443729.jpg', 47.00, 0, 99, '9787200069716', '［德］马克思　著，何小禾　编译', '重庆出版社', '', 169, '2007-10-01 00:00:00');
INSERT INTO `bms_book` VALUES (279, '影响商业的50本书', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 4, ' 重读商业经典，看懂经济变迁规律', 'http://image12.bookschina.com/2020/20200705/3/s8305895.jpg', 58.00, 0, 99, '9787308201346', '吴晓波', '浙江大学出版社', '', 332, '2020-07-01 00:00:00');
INSERT INTO `bms_book` VALUES (280, '解构现代化', '2020-12-24 00:00:00', '2020-12-26 00:00:00', 4, '本书是《告别百年激进》的姊妹篇，温铁军向我们剖析了“现代化”的问题乃至造成的现实危害，将国内外的很多问题，比如国际上的南北差距、国内的城乡差距、贫困问题等都“归结”为是“成本转嫁”导致的。总之，“成本转嫁”在国内外是普遍广泛存在着的一种现象作者认为：是“现代化”造成了“成本转嫁论”，也就是说一个国家只要在推进现代化，“成本转嫁”就是客观普遍存在着的，跟意识形态、文化传统乃至资本主义和社会主义的差异没有关系。', 'http://image12.bookschina.com/2020/20200829/1/s8370741.jpg', 49.00, 0, 99, '9787520715485', '温铁军', '东方出版社', '', 340, '2020-08-01 00:00:00');

-- ----------------------------
-- Table structure for bms_book_discount
-- ----------------------------
DROP TABLE IF EXISTS `bms_book_discount`;
CREATE TABLE `bms_book_discount`  (
  `id` bigint unsigned NOT NULL COMMENT '自增id',
  `book_id` bigint unsigned NOT NULL COMMENT '图书id',
  `count` int unsigned NOT NULL COMMENT '满足的商品数量',
  `discount` decimal(10, 2) UNSIGNED NOT NULL COMMENT '折扣',
  `price` decimal(10, 2) UNSIGNED NOT NULL COMMENT '折后价格',
  `create_time` datetime(0) NOT NULL COMMENT '记录创建时间',
  `modify_time` datetime(0) NOT NULL COMMENT '记录修改时间',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `uk_book_id`(`book_id`) USING BTREE COMMENT '图书id索引',
  INDEX `idx_create_time`(`create_time`) USING BTREE,
  INDEX `idx_modify_time`(`modify_time`) USING BTREE,
  CONSTRAINT `bms_book_discount_ibfk_1` FOREIGN KEY (`book_id`) REFERENCES `bms_book` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB AUTO_INCREMENT = 30 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of bms_book_discount
-- ----------------------------
INSERT INTO `bms_book_discount` VALUES (2, 258, 1, 0.70, 25.27, '2021-01-23 16:50:29', '2021-01-23 16:50:29');
INSERT INTO `bms_book_discount` VALUES (3, 233, 1, 0.70, 53.76, '2021-01-23 16:50:29', '2021-01-23 16:50:29');
INSERT INTO `bms_book_discount` VALUES (4, 267, 1, 0.70, 31.08, '2021-01-23 16:50:29', '2021-01-23 16:50:29');
INSERT INTO `bms_book_discount` VALUES (5, 139, 1, 0.70, 72.59, '2021-01-23 16:50:29', '2021-01-23 16:50:29');
INSERT INTO `bms_book_discount` VALUES (6, 250, 1, 0.70, 68.53, '2021-01-23 16:50:29', '2021-01-23 16:50:29');
INSERT INTO `bms_book_discount` VALUES (7, 33, 1, 0.70, 52.43, '2021-01-23 16:50:29', '2021-01-23 16:50:29');
INSERT INTO `bms_book_discount` VALUES (8, 13, 1, 0.70, 61.81, '2021-01-23 16:50:29', '2021-01-23 16:50:29');
INSERT INTO `bms_book_discount` VALUES (9, 225, 1, 0.70, 32.97, '2021-01-23 16:50:30', '2021-01-23 16:50:30');
INSERT INTO `bms_book_discount` VALUES (10, 151, 1, 0.70, 24.50, '2021-01-23 16:50:30', '2021-01-23 16:50:30');
INSERT INTO `bms_book_discount` VALUES (11, 86, 1, 0.70, 194.74, '2021-01-23 16:50:30', '2021-01-23 16:50:30');
INSERT INTO `bms_book_discount` VALUES (12, 138, 1, 0.70, 36.19, '2021-01-23 16:50:30', '2021-01-23 16:50:30');
INSERT INTO `bms_book_discount` VALUES (13, 166, 1, 0.70, 276.50, '2021-01-23 16:50:30', '2021-01-23 16:50:30');
INSERT INTO `bms_book_discount` VALUES (14, 154, 1, 0.70, 25.34, '2021-01-23 16:50:30', '2021-01-23 16:50:30');
INSERT INTO `bms_book_discount` VALUES (15, 246, 1, 0.70, 21.84, '2021-01-23 16:50:30', '2021-01-23 16:50:30');
INSERT INTO `bms_book_discount` VALUES (16, 216, 1, 0.70, 65.45, '2021-01-23 16:50:30', '2021-01-23 16:50:30');
INSERT INTO `bms_book_discount` VALUES (17, 215, 1, 0.70, 14.63, '2021-01-23 16:50:30', '2021-01-23 16:50:30');
INSERT INTO `bms_book_discount` VALUES (18, 35, 1, 0.70, 57.12, '2021-01-23 16:50:30', '2021-01-23 16:50:30');
INSERT INTO `bms_book_discount` VALUES (19, 121, 1, 0.70, 27.02, '2021-01-23 16:50:30', '2021-01-23 16:50:30');
INSERT INTO `bms_book_discount` VALUES (20, 87, 1, 0.70, 13.09, '2021-01-23 16:50:30', '2021-01-23 16:50:30');
INSERT INTO `bms_book_discount` VALUES (21, 84, 1, 0.70, 44.03, '2021-01-23 16:50:30', '2021-01-23 16:50:30');
INSERT INTO `bms_book_discount` VALUES (22, 146, 1, 0.70, 16.24, '2021-01-23 16:50:30', '2021-01-23 16:50:30');
INSERT INTO `bms_book_discount` VALUES (23, 80, 1, 0.70, 31.22, '2021-01-23 16:50:31', '2021-01-23 16:50:31');
INSERT INTO `bms_book_discount` VALUES (24, 257, 1, 0.70, 31.85, '2021-01-23 16:50:31', '2021-01-23 16:50:31');
INSERT INTO `bms_book_discount` VALUES (25, 130, 1, 0.70, 26.88, '2021-01-23 16:50:31', '2021-01-23 16:50:31');
INSERT INTO `bms_book_discount` VALUES (26, 26, 1, 0.70, 33.46, '2021-01-23 16:50:31', '2021-01-23 16:50:31');
INSERT INTO `bms_book_discount` VALUES (27, 241, 1, 0.70, 24.29, '2021-01-23 16:50:31', '2021-01-23 16:50:31');
INSERT INTO `bms_book_discount` VALUES (28, 82, 1, 0.70, 16.73, '2021-01-23 16:50:31', '2021-01-23 16:50:31');

-- ----------------------------
-- Table structure for bms_book_full_reduction
-- ----------------------------
DROP TABLE IF EXISTS `bms_book_full_reduction`;
CREATE TABLE `bms_book_full_reduction`  (
  `id` bigint unsigned NOT NULL COMMENT '自增id',
  `book_id` bigint unsigned NOT NULL COMMENT '图书id',
  `full_price` decimal(10, 2) NOT NULL COMMENT '商品满足金额',
  `reduce_price` decimal(10, 2) NOT NULL COMMENT '商品减少金额',
  `create_time` datetime(0) NOT NULL COMMENT '记录创建时间',
  `modify_time` datetime(0) NOT NULL COMMENT '记录修改时间',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `uk_book_id`(`book_id`) USING BTREE COMMENT '图书id',
  INDEX `idx_create_time`(`create_time`) USING BTREE,
  INDEX `idx_modify_time`(`modify_time`) USING BTREE,
  INDEX `full_price`(`full_price`) USING BTREE,
  CONSTRAINT `bms_book_full_reduction_ibfk_1` FOREIGN KEY (`book_id`) REFERENCES `bms_book` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `bms_book_full_reduction_ibfk_2` FOREIGN KEY (`full_price`) REFERENCES `bms_book` (`price`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB AUTO_INCREMENT = 1 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Table structure for bms_category
-- ----------------------------
DROP TABLE IF EXISTS `bms_category`;
CREATE TABLE `bms_category`  (
  `id` bigint unsigned NOT NULL COMMENT '自增id',
  `name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '分类名',
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `idx_name`(`name`) USING BTREE COMMENT '分类名索引'
) ENGINE = InnoDB AUTO_INCREMENT = 15 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of bms_category
-- ----------------------------
INSERT INTO `bms_category` VALUES (1, '医学与生物学');
INSERT INTO `bms_category` VALUES (2, '历史与考古');
INSERT INTO `bms_category` VALUES (3, '哲学与宗教');
INSERT INTO `bms_category` VALUES (4, '商业与经济');
INSERT INTO `bms_category` VALUES (5, '地球与环境科学');
INSERT INTO `bms_category` VALUES (6, '工程与应用科学');
INSERT INTO `bms_category` VALUES (7, '数学、物理与化学');
INSERT INTO `bms_category` VALUES (8, '新闻与传播');
INSERT INTO `bms_category` VALUES (9, '法律、政治与政府');
INSERT INTO `bms_category` VALUES (10, '社会科学');
INSERT INTO `bms_category` VALUES (11, '艺术与建筑');
INSERT INTO `bms_category` VALUES (12, '语言与文学');
INSERT INTO `bms_category` VALUES (13, '音乐、舞蹈、戏剧与电影');

-- ----------------------------
-- Table structure for bms_comment
-- ----------------------------
DROP TABLE IF EXISTS `bms_comment`;
CREATE TABLE `bms_comment`  (
  `id` bigint unsigned NOT NULL COMMENT '自增id',
  `book_id` bigint unsigned NOT NULL COMMENT '图书id',
  `user_id` bigint unsigned NOT NULL COMMENT '用户id',
  `star` int unsigned NOT NULL COMMENT '评价星数，0-5',
  `read_count` int unsigned NOT NULL COMMENT '评论阅读数',
  `collect_count` int unsigned NOT NULL COMMENT '评论收藏数',
  `picture` varchar(1000) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '评论上传图片地址，以逗号隔开',
  `reply_count` int unsigned NOT NULL COMMENT '评论回复数',
  `create_time` datetime(0) NOT NULL COMMENT '记录创建时间',
  `modify_time` datetime(0) NOT NULL COMMENT '记录修改时间',
  `show_status` tinyint unsigned NOT NULL COMMENT '是否显示',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `uk_book_id`(`book_id`) USING BTREE COMMENT '图书id索引',
  UNIQUE INDEX `uk_user_id`(`user_id`) USING BTREE COMMENT '用户id索引',
  INDEX `idx_create_time`(`create_time`) USING BTREE,
  INDEX `idx_modify_time`(`modify_time`) USING BTREE,
  CONSTRAINT `bms_comment_ibfk_1` FOREIGN KEY (`book_id`) REFERENCES `bms_book` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB AUTO_INCREMENT = 1 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Table structure for bms_comment_reply
-- ----------------------------
DROP TABLE IF EXISTS `bms_comment_reply`;
CREATE TABLE `bms_comment_reply`  (
  `id` bigint unsigned NOT NULL COMMENT '自增id',
  `comment_id` bigint unsigned NOT NULL COMMENT '评论id',
  `user_id` bigint unsigned NOT NULL COMMENT '回复用户的id',
  `create_time` datetime(0) NOT NULL COMMENT '记录创建时间',
  `modify_time` datetime(0) NOT NULL COMMENT '记录修改时间',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `uk_comment_id`(`comment_id`) USING BTREE COMMENT '评论id索引',
  UNIQUE INDEX `uk_user_id`(`user_id`) USING BTREE COMMENT '用户昵称索引',
  INDEX `idx_create_time`(`create_time`) USING BTREE,
  INDEX `idx_modify_time`(`modify_time`) USING BTREE,
  CONSTRAINT `bms_comment_reply_ibfk_1` FOREIGN KEY (`comment_id`) REFERENCES `bms_comment` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB AUTO_INCREMENT = 1 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Table structure for bms_comment_reply_content
-- ----------------------------
DROP TABLE IF EXISTS `bms_comment_reply_content`;
CREATE TABLE `bms_comment_reply_content`  (
  `reply_id` bigint unsigned NOT NULL COMMENT '评论回复id',
  `reply_content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '评论回复内容',
  PRIMARY KEY (`reply_id`) USING BTREE,
  CONSTRAINT `bms_comment_reply_content_ibfk_1` FOREIGN KEY (`reply_id`) REFERENCES `bms_comment_reply` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Table structure for bms_conmmnt_content
-- ----------------------------
DROP TABLE IF EXISTS `bms_conmmnt_content`;
CREATE TABLE `bms_conmmnt_content`  (
  `comment_id` bigint unsigned NOT NULL COMMENT '评论id',
  `comment_content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '评论内容',
  PRIMARY KEY (`comment_id`) USING BTREE,
  CONSTRAINT `bms_conmmnt_content_ibfk_1` FOREIGN KEY (`comment_id`) REFERENCES `bms_comment` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Table structure for oms_cart_item
-- ----------------------------
DROP TABLE IF EXISTS `oms_cart_item`;
CREATE TABLE `oms_cart_item`  (
  `id` bigint unsigned NOT NULL COMMENT '自增id',
  `book_id` bigint unsigned NOT NULL COMMENT '图书id',
  `quantity` int unsigned NOT NULL COMMENT '购买数量',
  `price` decimal(10, 2) UNSIGNED NOT NULL COMMENT '添加到购物车的价格',
  `create_time` datetime(0) NOT NULL COMMENT '记录创建时间',
  `modify_time` datetime(0) NOT NULL COMMENT '记录修改时间',
  `user_id` bigint unsigned NOT NULL COMMENT '用户表id',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `inddex`(`user_id`, `book_id`) USING BTREE,
  UNIQUE INDEX `user_id`(`user_id`, `book_id`) USING BTREE,
  UNIQUE INDEX `user_id_2`(`user_id`, `book_id`) USING BTREE,
  INDEX `idx_create_time`(`create_time`) USING BTREE,
  INDEX `idx_modify_time`(`modify_time`) USING BTREE,
  INDEX `book_id`(`book_id`) USING BTREE,
  CONSTRAINT `oms_cart_item_ibfk_1` FOREIGN KEY (`book_id`) REFERENCES `bms_book` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `oms_cart_item_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB AUTO_INCREMENT = 39 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of oms_cart_item
-- ----------------------------
INSERT INTO `oms_cart_item` VALUES (27, 233, 1, 53.76, '2021-01-23 23:38:20', '2021-01-23 23:38:20', 1);
INSERT INTO `oms_cart_item` VALUES (28, 267, 1, 31.08, '2021-01-23 23:41:24', '2021-01-23 23:41:24', 1);
INSERT INTO `oms_cart_item` VALUES (29, 139, 1, 72.59, '2021-01-23 23:43:45', '2021-01-23 23:43:45', 1);
INSERT INTO `oms_cart_item` VALUES (30, 250, 1, 68.53, '2021-01-23 23:43:58', '2021-01-23 23:43:58', 1);
INSERT INTO `oms_cart_item` VALUES (31, 138, 1, 36.19, '2021-01-23 23:47:08', '2021-01-23 23:47:08', 1);
INSERT INTO `oms_cart_item` VALUES (32, 216, 1, 65.45, '2021-01-23 23:49:16', '2021-01-23 23:49:16', 1);
INSERT INTO `oms_cart_item` VALUES (34, 80, 1, 31.22, '2021-01-23 23:56:10', '2021-01-23 23:56:10', 1);
INSERT INTO `oms_cart_item` VALUES (35, 82, 1, 16.73, '2021-01-23 23:59:10', '2021-01-23 23:59:10', 1);
INSERT INTO `oms_cart_item` VALUES (36, 155, 1, 39.20, '2021-01-24 13:39:41', '2021-01-24 13:39:41', 1);
INSERT INTO `oms_cart_item` VALUES (38, 276, 1, 53.70, '2021-01-24 14:49:51', '2021-01-24 14:49:51', 1);
INSERT INTO `oms_cart_item` VALUES (40, 26, 1, 33.46, '2021-01-24 16:22:50', '2021-01-24 16:22:50', 1);

-- ----------------------------
-- Table structure for oms_order
-- ----------------------------
DROP TABLE IF EXISTS `oms_order`;
CREATE TABLE `oms_order`  (
  `id` bigint unsigned NOT NULL COMMENT '自增id',
  `order_id` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '订单编号',
  `user_id` bigint unsigned NOT NULL COMMENT '用户id',
  `total_amount` decimal(10, 2) UNSIGNED NOT NULL COMMENT '订单总金额',
  `pay_amount` decimal(10, 2) UNSIGNED NOT NULL COMMENT '实际支付金额',
  `freight_amount` decimal(10, 2) UNSIGNED NOT NULL COMMENT '运费',
  `coupon_amount` decimal(10, 2) UNSIGNED NOT NULL COMMENT '优惠券抵扣金额',
  `promotion_amount` decimal(10, 2) NOT NULL COMMENT '满减金额',
  `confirm_status` int unsigned NOT NULL COMMENT '确认收货状态：0->未确认，1->已确认',
  `status` int unsigned NOT NULL COMMENT '订单状态：0->代付款；1->代发货;2->已发货;3->已完成;4->已关闭；5->无效订单',
  `delete_status` int unsigned NOT NULL COMMENT '删除订单状态：0->未删除，1->已删除',
  `note` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '订单备注',
  `create_time` datetime(0) NOT NULL COMMENT '记录创建时间',
  `modify_time` datetime(0) NOT NULL COMMENT '记录修改时间',
  `receive_time` datetime(0) NOT NULL COMMENT '确认收货时间',
  `pay_time` datetime(0) NOT NULL COMMENT '支付时间',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `uk_order_id`(`order_id`) USING BTREE COMMENT '订单id索引',
  UNIQUE INDEX `uk_user_id`(`user_id`) USING BTREE COMMENT '用户id索引',
  INDEX `idx_status`(`status`) USING BTREE COMMENT '订单状态索引',
  INDEX `idx_confirm_status`(`confirm_status`) USING BTREE COMMENT '订单确认状态索引',
  INDEX `idx_delete_status`(`delete_status`) USING BTREE COMMENT '订单删除状态索引',
  INDEX `idx_create_time`(`create_time`) USING BTREE,
  INDEX `idx_modify_time`(`modify_time`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 3 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of oms_order
-- ----------------------------
INSERT INTO `oms_order` VALUES (1, '1', 1, 123.00, 120.00, 0.00, 3.00, 0.00, 1, 3, 0, '数据库书籍', '2021-01-21 21:59:40', '2021-01-21 21:59:52', '2021-01-24 21:59:59', '2021-01-22 22:00:03');
INSERT INTO `oms_order` VALUES (2, '2', 2, 145.00, 145.00, 0.00, 0.00, 0.00, 0, 2, 0, '11', '2021-01-12 22:34:15', '2021-01-13 22:34:19', '2021-01-14 22:34:23', '2021-01-12 22:34:27');

-- ----------------------------
-- Table structure for role
-- ----------------------------
DROP TABLE IF EXISTS `role`;
CREATE TABLE `role`  (
  `role_id` tinyint unsigned NOT NULL COMMENT '权限id',
  `role_name` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '角色名称',
  PRIMARY KEY (`role_id`) USING BTREE,
  UNIQUE INDEX `uk_role_name`(`role_name`) USING BTREE COMMENT '权限名索引'
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of role
-- ----------------------------
INSERT INTO `role` VALUES (2, 'ROLE_ADMIN');
INSERT INTO `role` VALUES (1, 'ROLE_USER');

-- ----------------------------
-- Table structure for ums_user_email
-- ----------------------------
DROP TABLE IF EXISTS `ums_user_email`;
CREATE TABLE `ums_user_email`  (
  `id` bigint unsigned NOT NULL COMMENT '自增id',
  `user_id` bigint unsigned NOT NULL COMMENT '用户id',
  `email` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '用户邮箱',
  `create_time` datetime(0) NOT NULL COMMENT '创建时间',
  `modify_time` datetime(0) NOT NULL COMMENT '修改时间',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `uk_user_Id`(`user_id`) USING BTREE,
  UNIQUE INDEX `uk_email`(`email`) USING BTREE,
  INDEX `idx_create_time`(`create_time`) USING BTREE,
  INDEX `idx_modify_time`(`modify_time`) USING BTREE,
  CONSTRAINT `ums_user_email_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB AUTO_INCREMENT = 5 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of ums_user_email
-- ----------------------------
INSERT INTO `ums_user_email` VALUES (1, 1, '1800016616@pku.edu.cn', '2020-12-20 16:10:24', '2020-12-20 16:10:24');

-- ----------------------------
-- Table structure for ums_user_info
-- ----------------------------
DROP TABLE IF EXISTS `ums_user_info`;
CREATE TABLE `ums_user_info`  (
  `id` bigint unsigned NOT NULL COMMENT '自增id',
  `user_id` bigint unsigned NOT NULL COMMENT '用户帐号',
  `nick_name` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '用户昵称',
  `icon` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '用户头像地址',
  `gender` tinyint unsigned NOT NULL COMMENT '用户性别，0:男，1:女',
  `birthday` datetime(0) NOT NULL COMMENT '用户生日',
  `city` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '用户所在城市',
  `job` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '用户工作',
  `create_time` datetime(0) NOT NULL COMMENT '记录创建时间',
  `modify_time` datetime(0) NOT NULL COMMENT '记录修改时间',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `uk_user_id`(`user_id`) USING BTREE COMMENT '用户id索引',
  UNIQUE INDEX `uk_nick_name`(`nick_name`) USING BTREE COMMENT '用户昵称索引',
  INDEX `idx_city`(`city`) USING BTREE COMMENT '用户城市索引',
  INDEX `idx_create_time`(`create_time`) USING BTREE,
  INDEX `idx_modify_time`(`modify_time`) USING BTREE,
  CONSTRAINT `ums_user_info_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB AUTO_INCREMENT = 1 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Table structure for ums_user_receive_info
-- ----------------------------
DROP TABLE IF EXISTS `ums_user_receive_info`;
CREATE TABLE `ums_user_receive_info`  (
  `id` bigint unsigned NOT NULL COMMENT '自增id',
  `user_id` bigint unsigned NOT NULL COMMENT '用户id',
  `receiver_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '收货人姓名',
  `phone_number` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '收货电话',
  `post_code` char(6) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '邮政编码',
  `province` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '收货地省份',
  `city` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '收货地城市',
  `region` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '收货地县/乡镇',
  `detail_address` varchar(128) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '具体收货地址',
  `create_time` datetime(0) NOT NULL COMMENT '记录创建时间',
  `modify_time` datetime(0) NOT NULL COMMENT '记录修改时间',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `uk_user_id`(`user_id`) USING BTREE COMMENT '用户id索引',
  INDEX `idx_receiver_name`(`receiver_name`) USING BTREE COMMENT '收货人姓名索引',
  INDEX `idx_phone_number`(`phone_number`) USING BTREE COMMENT '收货人电话号码索引',
  INDEX `idx_create_time`(`create_time`) USING BTREE,
  INDEX `idx_modify_time`(`modify_time`) USING BTREE,
  CONSTRAINT `ums_user_receive_info_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB AUTO_INCREMENT = 5 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of ums_user_receive_info
-- ----------------------------
INSERT INTO `ums_user_receive_info` VALUES (1, 2, '常奥飞', '16600041898', '123456', '北京', '北京', '海淀', '北京大学', '2021-01-24 06:44:02', '2021-01-24 06:44:07');
INSERT INTO `ums_user_receive_info` VALUES (3, 1, '庞上智', '13207858058', '123456', '北京', '北京', '海淀', '北京大学', '2021-01-24 09:23:26', '2021-01-24 09:23:26');

-- ----------------------------
-- Table structure for ums_user_statistics_info
-- ----------------------------
DROP TABLE IF EXISTS `ums_user_statistics_info`;
CREATE TABLE `ums_user_statistics_info`  (
  `id` bigint unsigned NOT NULL COMMENT '自增id',
  `user_id` bigint unsigned NOT NULL COMMENT '用户id',
  `consume_amount` decimal(10, 2) UNSIGNED NOT NULL COMMENT '消费金额',
  `login_count` int unsigned NOT NULL COMMENT '登录次数',
  `order_count` int unsigned NOT NULL COMMENT '订单数量',
  `coupon_count` int unsigned NOT NULL COMMENT '优惠券数量',
  `collect_book_count` int unsigned NOT NULL COMMENT '收藏书籍数量',
  `collect_comment_count` int unsigned NOT NULL COMMENT '收藏评论数量',
  `recent_order_time` datetime(0) NOT NULL COMMENT '最近订单日期',
  `modify_time` datetime(0) NOT NULL COMMENT '记录修改时间',
  `create_time` datetime(0) NOT NULL COMMENT '记录创建时间',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `uk_user_id`(`user_id`) USING BTREE COMMENT '用户id索引',
  INDEX `idx_create_time`(`create_time`) USING BTREE,
  INDEX `idx_modify_time`(`modify_time`) USING BTREE,
  CONSTRAINT `ums_user_statistics_info_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB AUTO_INCREMENT = 1 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user`  (
  `id` bigint unsigned NOT NULL COMMENT '用户id',
  `username` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '用户账号',
  `password` char(60) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '密码',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `uk_username`(`username`) USING BTREE COMMENT '用户名索引'
) ENGINE = InnoDB AUTO_INCREMENT = 6 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES (1, 'cuterwrite', '$2a$10$8JYTyWX584ipNzWraQcobuAvTm6CNlRAolQnTwNz0fmw0ZjtXQM76');
INSERT INTO `user` VALUES (2, 'truman', '@00043#316');

-- ----------------------------
-- Table structure for user_role
-- ----------------------------
DROP TABLE IF EXISTS `user_role`;
CREATE TABLE `user_role`  (
  `user_id` bigint unsigned NOT NULL COMMENT '用户账号',
  `role_id` tinyint unsigned NOT NULL COMMENT '权限id',
  PRIMARY KEY (`user_id`, `role_id`) USING BTREE,
  INDEX `FK_role_id`(`role_id`) USING BTREE,
  INDEX `user_id`(`user_id`) USING BTREE,
  CONSTRAINT `user_role_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `user_role_ibfk_2` FOREIGN KEY (`role_id`) REFERENCES `role` (`role_id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of user_role
-- ----------------------------
INSERT INTO `user_role` VALUES (1, 1);

SET FOREIGN_KEY_CHECKS = 1;
