<template>
    <div>
        <a-breadcrumb separator="">
            <a-breadcrumb-item>
                <router-link to="/store/index">当前位置：首页</router-link>
            </a-breadcrumb-item>
            <a-breadcrumb-separator>></a-breadcrumb-separator>
            <a-breadcrumb-item>
                畅销榜
            </a-breadcrumb-item>
        </a-breadcrumb>
        <a-divider></a-divider>
        <div style="text-indent: 2em;">
            <p>为认真贯彻落实学校疫情管控工作部署，满足广大师生员工锻炼需求，按照科学防控、精准施策原则，严防体育场馆集聚性风险，确保安全有序，场地信息对称，最大限度保障场地供给和优化资源配置，特推出非教学时段体育场馆实行预约管理，师生员工可查询各场地的实时状态线上预约（暂开放部分场地），在指定时段持校园卡或预约码入场。</p>
            <p>1、入口：“北京大学APP智慧场馆模块”、“北大校内信息门户智慧场馆模块”、“北大体育教研部官网智慧场馆模块”。</p>
            <p>2、本系统当前为试运行阶段，暂开放部分场地网上预约和支付，待系统和业务流程完善后，我们将逐渐提高服务水平。</p>
            <p>3、可查询部分场馆人群实时流量。</p>
            <p>4、每天中午12点开放预约往后3天后的场地预约权限。</p>
            <p>5、使用北京大学IAAA统一身份认证/系统注册账号登录后，按需预约场地。</p>
            <p>6、单位时段根据各项目特点分1小时和1.5小时，一天每人最多可预约连续的两个单位时段，同一时段每人只能预约1片场地。</p>
            <p>7、免费的室外场地，建议在线预约。当出现场地使用权争议时，将遵循谁预约谁使用的原则。</p>
            <p>8、为配合疫情防控，羽毛球、网球和篮球预约时需要同时登记同伴实名信息，确保登记信息和实际入场人员信息一致。预约成功后，同伴可使用校园卡和预约码入场（同伴登录后在个人中心查看预约码）。</p>
            <p>9、为保障场地使用效率，预约羽毛球每片场地填写2-6人、网球1-6人、篮球半场4-12人、篮球全场8-24人、台球1-4人、乒乓球2-4人、壁球1-4人。登记同伴前，必须确保同伴已经登录过本系统（登录方式见第1条）。</p>
            <p>10、提交预约后，请在5分钟内完成支付，超时则自动释放。</p>
            <p>11、预约成功后，如因用户个人原因需取消订单，由用户自行取消订单，取消订单时间距使用时间24小时以上退全款，24小时以内费用不退；如遇学校原因无法提供场地服务需取消订单时，由学校进行取消订单操作，全额退费。所有退订，均不计入爽约次数。</p>
            <p>12、退费周期，学校财务执行收支两条线，人工审核，10个工作日内原路返回，请耐心等候。</p>
            <p>13、紧缺类场地预约成功后，在使用时段内未验票入场，费用不退，计爽约1次。累计爽约2次者，取消预约权限15天，15天后自动恢复预约权限，爽约次数清零。</p>
            <p>14、健身房和游泳馆办理会员后可直接入场，也可网上/前台购买单次票，凭票入场。</p>
            <p>15、用户可通过校园卡、北京大学收费平台（支付宝、微信、银联、境外卡）、个人账户进行缴费。</p>
            <p>16、用户订场后，不得擅自改变场地用途，如有特殊场地使用需求，请于预约前联系场地管理单位。</p>
            <p>17、如有其他订场需求，请线下办理相关手续。</p>
            <p>18、如遇学校大型活动及维修等特殊情况或不可抗力因素无法提供场地服务，请服从退订或调剂安排。</p>
            <p>19、本系统公布价格依据为《北京大学收费立项审批单》（2010年2月24日）、《北京大学收费立项审批单》（2011年8月26日）。</p>
            <p>20、咨询与建议：请通过首页咨询与建议模块进行反馈。</p>
        </div>
    </div>
</template>
<script>
export default {
    data() {
        return {

        }
    }
}
</script>
<style scope>
.ant-breadcrumb {
    font-size: 16px;
}

.ant-divider-horizontal {
    margin-top: 16px !important;
    margin-bottom: 16px !important;
}
</style>